Repository: btdn/unknown-horizons
Catalog: po/uh/*.po
Languages: th

source: Starting engine…
th: กำลังสตาร์ทเครื่องยนต์…

source: Catching fish…
th: กำลังจับปลา…

source: Drawing user interface…
th: กำลังวาดส่วนติดต่อผู้ใช้…

source: Activating timer…
th: กำลังเปิดใช้งานตัวจับเวลา…

source: Chomping game data…
th: กำลังย่อยข้อมูลเกม…

source: Shaping islands…
th: กำลังปรับรูปร่างของเกาะ…

source: Preparing blueprints…
th: กำลังเตรียมพิมพ์เขียว…

source: Filling world with water…
th: กำลังเทน้ำเติมลงบนโลก…

source: Raising animals…
th: กำลังต้อนฝูงสัตว์…

source: Convincing AI…
th: มองหา AI ที่น่าเชื่อถือ…

source: Burying treasures…
th: กำลังหาที่ฝั่งสมบัติ…

source: Unable to find pyenet
th: ไม่พบ pyenet

source: The multiplayer feature requires the library "pyenet", which could not be found on your system.
th: คุณสมบัติผู้เล่นหลายคนต้องใช้ไลบรารี "pyenet" ซึ่งตรวจหาไม่พบในระบบของคุณ.

source: Linux users: Try to install pyenet through your package manager.
th: ผู้ใช้ Linux: ลองติดตั้งแพ็ค pyenet ผ่านทางตัวจัดการแพ็คเก็จของดิสโทรที่คุณใช้.

source: Failed to initialize networking.
th: ไม่สามารถเริ่มต้นเครือข่าย.

source: Network features could not be initialized with the current configuration.
th: ไม่สามารถเริ่มต้นคุณสมบัติเครือข่ายด้วยการกำหนดค่าปัจจุบัน.

source: Check the settings you specified in the network section.
th: ตรวจสอบการตั้งค่าที่คุณได้ระบุไว้ในส่วนตั้งค่าเครือข่าย.

source: Fatal Network Error
th: ข้อผิดพลาดเครือข่ายที่ร้ายแรง

source: Could not connect to master server.
th: ไม่สามารถเชื่อมต่อกับเซิร์ฟเวอร์หลัก.

source: Please check your Internet connection. If it is fine, it means our master server is temporarily down.
th: โปรดตรวจสอบการเชื่อมต่ออินเตอร์เน็ตของคุณ หากใช้ได้ก็หมายความว่าเซิร์ฟเวอร์หลักของเราหยุดให้บริการชั่วคราว.

source: Something went wrong with the network:
th: มีบางอย่างผิดพลาดกับเครือข่าย:

source: Version differs!
th: เวอร์ชันแตกต่าง!

source: Map: {map_name}
th: แผนที่: {map_name}

source: Name: {game_name}
th: ชื่อเกม: {game_name}

source: Creator: {game_creator}
th: ผู้สร้าง: {game_creator}

source: Players: {player_amount}/{player_limit}
th: ผู้เล่น: {player_amount}/{player_limit}

source: Wrong version
th: รุ่นไม่ถูกต้อง

source: The game's version differs from your version. Every player in a multiplayer game must use the same version. This can be fixed by every player updating to the latest version. Game version: {game_version} Your version: {own_version}
th: เวอร์ชั่นของเกมแตกต่างไปจากเวอร์ชั่นที่คุณใช้งานอยู่ ผู้เล่นทุกคนที่ต้องการเข้าร่วมเล่นแบบหลายคนจะต้องใช้ตัวเกมที่มีเวอร์ชั่นเดียวกัน ปัญหานี้สามารถแก้ไขได้โดยให้ผู้เล่นทุกคนทำการอัพเดตตัวเกมเป็นเวอร์ชั่นล่าสุด. เวอร์ชั่นของเกม: {game_version} เวอร์ชั่นของคุณ: {own_version}

source: Password of the game
th: รหัสผ่านของเกม

source: Enter password:
th: ใส่รหัสผ่าน:

source: Recommended number of players: {number}
th: จำนวนผู้เล่นที่แนะนำ: {number}

source: Ready
th: พร้อม

source: Not ready
th: ไม่พร้อม

source: Enter your message
th: กรอกข้อความของคุณ

source: Click here to change your name and/or color
th: คลิกที่นี่เพื่อเปลี่ยน ชื่อและสี ของคุณ

source: Kick {player}
th: เตะ {player}

source: {player} has joined the game
th: {player} ได้เข้าร่วมเกม

source: {player} has left the game
th: {player} ออกไปจากเกม

source: You are now ready
th: ตอนนี้คุณพร้อมแล้ว

source: You are not ready anymore
th: คุณยังไม่พร้อมในตอนนี้

source: {player} is now ready
th: {player} พร้อมแล้วในตอนนี้

source: {player} not ready anymore
th: {player} ยังไม่พร้อมในตอนนี้

source: You are now known as {new_name}
th: ตอนนี้คุณเป็นที่รู้จักในฐานะ {new_name}

source: {player} is now known as {new_name}
th: ตอนนี้ {player} เป็นที่รู้จักในฐานะ {new_name}

source: You changed your color
th: คุณเปลี่ยนสีของคุณ

source: {player} changed their color
th: {player} ได้เปลี่ยนสีของเขา

source: Kicked
th: ถูกเตะ

source: You have been kicked from the game by creator
th: คุณถูกเตะออกจากเกมโดยผู้สร้าง

source: {player} got kicked by creator
th: {player} ถูกเตะออกไปโดยผู้สร้าง

source: Are you sure you want to abort the running session?
th: คุณแน่ใจหรือไม่ว่าต้องการยกเลิกเซสชันที่กำลังทำงานอยู่?

source: Quit Session
th: ออกจากเซสชั่น

source: No saved games
th: ไม่มีเกมที่บันทึกไว้

source: There are no saved games to load.
th: ไม่มีเกมที่บันทึกไว้ให้โหลด.

source: No filename given
th: ไม่มีชื่อไฟล์.

source: Please enter a valid filename.
th: กรุณาใส่ชื่อไฟล์ที่ถูกต้อง.

source: A savegame with the name {name} already exists.
th: ไฟล์เซฟเกมที่ใช้ชื่อ {name} มีอยู่แล้ว.

source: A map with the name {name} already exists.
th: แผนที่ที่ใช้ชื่อ {name} มีอยู่แล้ว.

source: Overwrite it?
th: เขียนทับมันไหม?

source: Unknown savedate
th: ไม่รู้วันที่บันทึก

source: Saved at {time}
th: ถูกบันทึกเมื่อ {time}

source: Saved {amount} time
th: บันทึกไป {amount} ครั้ง

source: Savegame version {version}
th: เซฟจากเกมเวอร์ชั่น {version}

source: (probably incompatible)
th: (อาจเข้ากันไม่ได้)

source: Incompatible version
th: รุ่นที่เข้ากันไม่ได้

source: No file selected
th: ไม่ได้เลือกไฟล์

source: You need to select a savegame to delete.
th: คุณต้องเลือกเซฟเกมเพื่อลบ.

source: Do you really want to delete the savegame '{name}'?
th: คุณต้องการลบเซฟเกมที่ชื่อ '{name}' จริงๆหรือ?

source: Confirm deletion
th: ยืนยันการลบ

source: Error!
th: ข้อผิดพลาด!

source: Failed to delete savefile!
th: ไม่สามารถลบไฟล์เซฟ!

source: Hotkeys
th: คีย์ลัด

source: Game
th: เกม

source: Disabled
th: ปิดใช้งาน

source: Restart required
th: จำเป็นต้องเริ่มต้นใหม่

source: Some of your changes require a restart of Unknown Horizons. Do you want to restart Unknown Horizons now?
th: การเปลี่ยนแปลงบางอย่างของคุณจำเป็นต้องเริ่ม Unknown Horizons ใหม่ คุณต้องการเริ่มการทำงานใหม่ในตอนนี้หรือไม่?

source: Restore default settings
th: คืนค่าเป็นการตั้งค่าเริ่มต้น

source: Restoring the default settings will delete all changes to the settings you made so far.
th: การเรียกคืนการตั้งค่าเริ่มต้นจะลบการเปลี่ยนแปลงการตั้งค่าทั้งหมดที่คุณได้ทำไว้.

source: Do you want to continue?
th: คุณต้องการจะดำเนินการต่อหรือไม่?

source: Invalid network port
th: พอร์ตของเครือข่ายไม่ถูกต้อง.

source: The port you specified is not valid. It must be a number between 1 and 65535.
th: พอร์ตที่คุณระบุไม่ถูกต้อง ค่าที่ใช้ต้องเป็นตัวเลขระหว่าง 1 ถึง 65535.

source: Please check the port you entered and make sure it is in the specified range.
th: โปรดตรวจสอบพอร์ตที่คุณป้อนและตรวจสอบให้แน่ใจว่าอยู่ในช่วงที่ระบุ.

source: Failed to apply new network settings.
th: ไม่สามารถใช้การตั้งค่าเครือข่ายใหม่.

source: Low port numbers sometimes require special access privileges, try 0 or a number greater than 1024.
th: บางครั้งหมายเลขพอร์ตที่ต่ำจำเป็นต้องมีสิทธิ์การเข้าถึงพิเศษ ลองตั้งให้เป็น 0 หรือลองตัวเลขที่มากกว่า 1024.

source: Invalid player name
th: ชื่อผู้เล่นไม่ถูกต้อง

source: You entered an invalid playername.
th: คุณป้อนชื่อผู้เล่นที่ไม่ถูกต้อง.

source: Resource density:
th: ความหนาแน่นของทรัพยากร:

source: Map size:
th: ขนาดของแผนที่:

source: Water:
th: ระดับน้ำ:

source: Max island size:
th: ขนาดสูงสุดของเกาะ:

source: Preferred island size:
th: ขนาดเกาะที่ต้องการ:

source: Island size deviation:
th: การเบี่ยงเบนขนาดเกาะ:

source: Click to generate a different random map
th: คลิกเพื่อสร้างแผนที่แบบสุ่มอื่น

source: Invalid scenario file
th: ไฟล์จำลองเนื้อเรื่องไม่ถูกต้อง

source: The selected file is not a valid scenario file.
th: ไฟล์ที่เลือกไม่ใช่ไฟล์จำลองเนื้อเรื่องของเกมที่ถูกต้อง.

source: Error message:
th: ข้อความผิดพลาด:

source: Please report this to the author.
th: กรุณารายงานสิ่งนี้ให้กับผู้พัฒนา.

source: Difficulty: {difficulty}
th: ความยาก: {difficulty}

source: Author: {author}
th: ผู้พัฒนา: {author}

source: Description: {desc}
th: รายละเอียด: {desc}

source: Build {building}
th: สร้าง {building}

source: Press H to remove this hint
th: กด H เพื่อลบคำแนะนำนี้

source: Destroy all buildings
th: ทำลายสิ่งปลูกสร้างทั้งหมด

source: This will destroy all the buildings that fall outside of the settlement range.
th: สิ่งนี้จะทำลายสิ่งปลูกสร้างทั้งหมดที่อยู่นอกช่วงการตั้งถิ่นฐาน.

source: %s additional building will be destroyed.
th: %s สิ่งปลูกสร้างจะถูกทำลายเพิ่มเติม

source: Barracks overview
th: ภาพรวมของที่พักทหาร

source: Swordman
th: นักดาบ

source: Overview
th: ภาพรวม

source: {ship} (place in queue: {place})
th: {ship} (วางลงในคิว: {place})

source: Boat builder overview
th: ภาพรวมของผู้สร้างเรือ

source: Fisher boats
th: เรือหาปลา

source: Trade boats
th: เรือการค้า

source: War boats
th: เรือสงคราม

source: War ships
th: เรือรบ

source: Tower overview
th: ภาพรวมของทาวเวอร์

source: Build related buildings
th: สร้างสิ่งปลูกสร้างที่เกี่ยวข้อง

source: Click on one of the resource slots to add a trade offer.
th: คลิกที่หนึ่งในช่องทรัพยากรเพื่อเพิ่มข้อเสนอทางการค้า.

source: Set to buy or sell by clicking on that label, then adjust the amount via the slider to the right.
th: ตั้งค่าเป็นซื้อหรือขายโดยคลิกที่ป้ายกำกับ หลังจากนั้นปรับจำนวนเงินผ่านทางตัวเลื่อนไปทางขวา.

source: Will buy {resource_name} for {price} gold/t whenever less than {limit}t are in stock.
th: จะซื้อ {resource_name} ในราคา {price} ทอง/ตัน ทุกครั้งที่เหลืออยู่ในสต็อกน้อยกว่า {limit} ตัน.

source: Will sell {resource_name} for {price} gold/t whenever more than {limit}t are available.
th: จะขาย {resource_name} ในราคา {price} ทอง/ตัน ทุกครั้งที่มีเหลืออยู่มากกว่า {limit} ตัน.

source: Warehouse overview
th: ภาพรวมของคลังสินค้า

source: Account
th: บัญชี

source: Main square overview
th: ภาพรวมจัตุรัสหลัก

source: Upgrade not possible:
th: ไม่สามารถอัพเกรดได้:

source: This is the highest playable tier for now!
th: นี่เป็นระดับที่เล่นได้สูงสุดในตอนนี้!

source: Don't allow upgrades
th: ไม่อนุญาตให้อัพเกรด

source: Allow upgrades
th: อนุญาตให้อัพเกรด

source: Unit overview
th: ภาพรวมของยูนิต

source: Production overview
th: ภาพรวมการผลิต

source: Fill range with {how_many} trees
th: เติมในพื้นที่ด้วยต้นไม้ {how_many} ต้น

source: Selected Units
th: ยูนิตที่ได้เลือก

source: Ship overview
th: ภาพรวมของเรือ

source: The ship needs to be close to an island to found a settlement.
th: เรือลำนี้จะต้องอยู่ใกล้กับเกาะเพื่อค้นหาพื้นที่สำหรับตั้งถิ่นฐาน.

source: You already have a settlement on this island.
th: คุณได้ตั้งถิ่นฐานบนเกาะนี้ไปแล้ว.

source: Load/Unload
th: โหลดขึ้น/โหลดลง

source: Buy/Sell
th: ซื้อ/ขาย

source: Too far from the nearest tradeable warehouse
th: อยู่ห่างจากคลังสินค้าที่ใกล้ที่สุดที่สามารถซื้อขายได้.

source: Cannot equip trade ship with weapons
th: ไม่สามารถติดตั้งอาวุธบนเรือการค้า.

source: It is not possible to equip a trade ship with weapons.
th: มันเป็นไปไม่ได้ที่จะติดตั้งอาวุธบนเรือเพื่อการค้า.

source: Equip weapon
th: ติดตั้งอาวุธ

source: Unequip weapon
th: ปลดอาวุธออก

source: {resource_name}: {price} gold
th: {resource_name}: {price} ทอง

source: buy for {buyprice} gold
th: ซื้อในราคา {buyprice} ทอง

source: sell for {sellprice} gold
th: ขายในราคา {sellprice} ทอง

source: Limit: {amount}t per slot
th: จำกัด: {amount}ตันต่อช่อง

source: Logbook
th: สมุดบันทึก

source: Emptiness
th: สิ่งที่ว่างเปล่า

source: There is nothing written in your logbook yet!
th: ยังไม่มีอะไรถูกเขียนลงในสมุดบันทึกของคุณในตอนนี้!

source: Settlements of {player}
th: การตั้งถิ่นฐานของ {player}

source: Ships of {player}
th: เรือของ {player}

source: None
th: ไม่มี

source: N/A
th: ไม่มี

source: Production overview of {settlement}
th: ภาพรวมการผลิตของ {settlement}

source: Click to show statistics
th: คลิกเพื่อแสดงสถิติ

source: Click to add a new slot
th: คลิกเพื่อเพิ่มช่องใหม่

source: Reset this configuration to the factory default.
th: รีเซ็ตการกำหนดค่านี้เป็นค่าเริ่มต้นจากโรงงาน.

source: Reset this settlement's displayed resources to the default configuration you have saved.
th: รีเซ็ตทรัพยากรที่แสดงของการตั้งถิ่นฐานนี้เป็นการตั้งค่าเริ่มต้นที่คุณได้บันทึกไว้.

source: Reset the default configuration (which you see here) to the factory default for all settlements.
th: รีเซ็ตการกำหนดค่าเริ่มต้น(ที่คุณได้เห็นที่นี่) เป็นค่าเริ่มต้นจากโรงงานสำหรับการตั้งถิ่นฐานทั้งหมด.

source: Buy expenses
th: เสียไปจากการซื้อ

source: Sell income
th: รายได้จากการขาย

source: Stop route
th: หยุดเส้นทาง

source: Need at least two settlements
th: ต้องการการตั้งถิ่นฐานอย่างน้อยสองแห่ง

source: You need at least two different settlements in your route.
th: คุณต้องมีปลายทางเป็นสถานที่ที่มีการตั้งถิ่นฐานอย่างน้อยสองแห่งในเส้นทางของคุณ.

source: Click on a settlement to add a waypoint!
th: คลิกบนการตั้งถิ่นฐานเพื่อเพิ่มลงในเส้นทาง!

source: Loading into ship
th: โหลดขึ้นมาที่เรือ

source: Unloading from ship
th: โหลดลงไปจากเรือ

source: You are not allowed to trade with this player
th: คุณไม่ได้รับอนุญาตให้ทำการค้ากับผู้เล่นนี้

source: none
th: ไม่มี

source: Details: {error_details}
th: รายละเอียด: {error_details}

source: Error: {error_message}
th: ข้อผิดพลาด: {error_message}

source: Bakery
th: เบเกอรี่

source: Consumes flour. Produces food.
th: ใช้งานแป้งเพื่อนำไปผลิตอาหาร.

source: Barracks
th: ที่พักทหาร

source: Recruits units suitable for ground combat.
th: รับสมัครยูนิตที่เหมาะสมสำหรับการต่อสู้บนพื้นดิน.

source: Wooden barrier
th: เครื่องกีดขวางไม้

source: Clay wall
th: ผนังดิน

source: Provides security.
th: ให้ความปลอดภัย.

source: Blender
th: เครื่องบด

source: Produces condiments out of spices.
th: ผลิตเครื่องปรุงรสออกมาจากเครื่องเทศ.

source: Boat Builder
th: นักต่อเรือ

source: Builds boats and small ships. Built on coast.
th: สร้างเรือสำเภาและเรือขนาดเล็กบนชายฝั่ง.

source: Brewery
th: โรงหมัก

source: Consumes hops. Produces Beer.
th: ใช้งานฮอปส์เพื่อผลิตเบียร์.

source: Brickyard
th: โรงอิฐ

source: Turns clay into bricks.
th: ปั้นดินเหนียวให้เป็นก้อนอิฐ.

source: Butchery
th: โรงแล่เนื้อ

source: Needs pigs or cattle. Produces food.
th: ต้องการหมูหรือวัวแล่เป็นเนื้อเพื่อนำไปใช้เป็นอาหาร.

source: Cannon Foundry
th: โรงหล่อปืนใหญ่

source: Produces Cannons.
th: ผลิตปืนใหญ่.

source: Charcoal Burning
th: โรงเผาถ่าน

source: Burns a lot of boards.
th: เผาไม้เพื่อผลิตถ่านสำหรับใช้เป็นเชิ้อเพลิง.

source: Clay Deposit
th: โรงรับฝากดิน

source: Clay Pit
th: หลุมดิน

source: Gets clay from deposit.
th: รับดินจากการฝาก.

source: Distillery
th: โรงต้มกลั่น

source: Turns sugar into liquor.
th: กลั่นน้ำตาลให้เป็นเหล้า.

source: Doctor
th: หมอรักษา

source: Treats diseases. Consumes herbs.
th: รักษาโรคภัยด้วยการใช้สมุนไพร.

source: Farm
th: ฟาร์ม

source: Grows field crops and raises livestock.
th: ปลูกพืชไร่และเลี้ยงปศุสัตว์.

source: Alvearies
th: โรงเลี้ยงผึ้ง

source: Keeps bees. Produces honeycombs used for confectionery. Needs a farm.
th: เลี้ยงผึ้งเพื่อผลิตน้ำผึ้งที่ใช้สำหรับทำขนม ต้องการใช้งานโดยฟาร์ม.

source: Cattle Run
th: ทุ่งเลี้ยงวัว

source: Raises cattle. Needs a farm.
th: พื้นที่สำหรับเลี้ยงวัว ต้องการฟาร์ม.

source: Cocoa Field
th: ไร่โกโก้

source: Produces cocoa beans used for confectionery. Needs a farm.
th: ผลิตเมล็ดโกโก้ที่ใช้สำหรับทำขนม ต้องการฟาร์ม.

source: Corn Field
th: ไร่ข้าวโพด

source: Yields corn. Needs a farm.
th: ไร่สำหรับปลูกข้าวโพด ต้องการฟาร์ม.

source: Herbary
th: โรงปลูกสมุนไพร

source: Produces herbs. Needs a farm.
th: ผลิตสมุนไพร ต้องการฟาร์ม.

source: Hop Field
th: ไร่ฮอปส์

source: Yields hop. Needs a farm.
th: ไร่สำหรับปลูกต้นฮอปส์ ต้องการฟาร์ม.

source: Pasture
th: ทุ่งเลี้ยงสัตว์

source: Raises sheep. Produces wool. Needs a farm.
th: ทุ่งสำหรับเลี้ยงแกะเพื่อนำไปตัดขน ต้องการฟาร์ม.

source: Pigsty
th: คอกหมู

source: Raises pigs. Needs a farm.
th: คอกสำหรับเลี้ยงหมู ต้องการฟาร์ม.

source: Potato Field
th: ไร่มันฝรั่ง

source: Yields food. Needs a farm.
th: ให้ผลผลิตที่เป็นอาหาร ต้องการฟาร์ม.

source: Spice Field
th: ไร่เครื่องเทศ

source: Grows spices. Needs a farm.
th: ไร่สำหรับปลูกเครื่องเทศ ต้องการฟาร์ม.

source: Sugar Field
th: ไร่อ้อย

source: Used in liquor production. Needs a farm.
th: ใช้สำหรับโรงกลั่น ต้องการฟาร์ม.

source: Tobacco Field
th: ไร่ยาสูบ

source: Produces tobacco. Needs a farm.
th: ผลิตใบยาสูบ ต้องการฟาร์ม.

source: Vineyard
th: ไร่องุ่น

source: Produces grapes for use in wine and confectionery. Needs a farm.
th: ผลิตองุ่นสำหรับใช้หมักเป็นไวน์และใช้ทำขนม ต้องการฟาร์ม.

source: Fire Station
th: สถานีระวังไฟ

source: Extinguishes fires.
th: ช่วยในการดับไฟ.

source: Fish Deposit
th: ที่ฝากปลา

source: Fisherman's Tent
th: เต็นท์คนหาปลา

source: Fishes the sea, produces food.
th: ที่พักสำหรับคนหาปลาในทะเล เพื่อใช้เป็นอาหาร.

source: Hunter's Tent
th: เต็นท์คนล่าสัตว์

source: Hunts wild forest animals, produces food.
th: ล่าสัตว์ที่อยู่ในป่า เพื่อนำไปใช้เป็นอาหาร.

source: Lookout
th: หอเฝ้าระวัง

source: Expands settlement range.
th: ขยายอาณาเขตของการตั้งถิ่นฐาน.

source: Lumberjack Tent
th: เต็นท์คนตัดไม้

source: Lumberjack Hut
th: กระท่อมคนตัดไม้

source: Chops down trees and turns them into boards.
th: ตัดต้นไม้เพื่อแปรรูปเป็นไม้กระดาน.

source: Main Square
th: จัตุรัสหลัก

source: Supplies citizens with goods. Provides community.
th: จัดหาทรัพยากรให้กับผู้อยู่อาศัย เพื่ออำนวยความสะดวกให้กับชุมชน.

source: Mine
th: เหมือง

source: Gets iron ore from deposit.
th: สกัดแร่เหล็กจากการรับฝาก.

source: Mountain
th: ภูเขา

source: Pastry Shop
th: ร้านขนมอบ

source: Produces all kinds of confectionery.
th: ผลิตอาหารหลายๆอย่างประเภทขนม.

source: Pavilion
th: ศาลา

source: Fulfills religious needs of sailors.
th: ตอบสนองความต้องการทางศาสนาของลูกเรือ.

source: Ruined Tent
th: เต็นท์ที่ถูกทิ้งล้าง

source: Salt Ponds
th: บ่อเกลือ

source: Evaporates salt. Built on sea coast.
th: บ่อสำหรับระเหยน้ำเกลือ ต้องสร้างขึ้นบนชายฝั่งทะเล.

source: Signal Fire
th: ไฟสัญญาณ

source: Allows the player to trade with the free trader.
th: อนุญาตให้อาณานิคมทำการค้ากับพ่อค้าอิสระ.

source: Smeltery
th: โรงหล่อ

source: Refines all kind of ores.
th: กลั่นแร่ทุกชนิด.

source: Stone Deposit
th: รับฝากหิน

source: Stonemason
th: ช่างก่อหิน

source: Carver
th: ช่างแกะสลัก

source: Carves stone tops into bricks.
th: ช่างแกะสลักหินให้เป็นก้อนอิฐ.

source: Stone Pit
th: หลุมหิน

source: Gets stone from a mountain.
th: สกัดหินออกมาจากภูเขา.

source: Storage Tent
th: เต็นท์เก็บของ

source: Storage Hut
th: โรงเก็บของ

source: Extends stock, expands settlement range and provides collectors.
th: ขยายพื้นที่ให้กับคลังสินค้าและช่วยขยายขอบเขตให้กับการตั้งถิ่นฐาน และยังช่วยเพิ่มจำนวนคนงานขนของ.

source: Tavern
th: โรงเหล้า

source: Provides get-together.
th: สถานที่รวมตัวกันเพื่อจัดงานสังสรรค์.

source: Tent
th: เต็นท์

source: Hut
th: กระท่อม

source: House
th: บ้าน

source: Stone house
th: บ้านหิน

source: Estate
th: ที่ดิน

source: Manor
th: คฤหาสน์และที่ดิน

source: Houses your inhabitants.
th: ที่พักสำหรับผู้อยู่อาศัยของคุณ.

source: Tobacconist
th: พ่อค้ายาสูบ

source: Produces tobaccos out of tobacco.
th: ทำผลิตภัณฑ์ยาสูบออกมาจากโรงงานยาสูบ.

source: Toolmaker
th: โรงผลิตเครื่องมือ

source: Produces tools out of iron.
th: ผลิตเครื่องมือที่ทำจากเหล็ก.

source: Trail
th: เส้นทาง

source: Gravel Path
th: เส้นทางกรวด

source: Cobblestone Street
th: ถนนหินกรวด

source: Needed for collecting goods.
th: จำเป็นสำหรับการรวบรวมสินค้า.

source: Tree
th: ต้นไม้

source: Provides lumber. Chopped down by lumberjacks.
th: ให้ผลผลิตเป็นไม้แปรรูป ตัดลงมาโดยคนตัดไม้.

source: Village School
th: โรงเรียนของหมู่บ้าน

source: Provides education.
th: มอบการศึกษาให้กับเด็กรุ่นใหม่.

source: Warehouse
th: คลังสินค้า

source: Weaponsmith
th: ช่างตีอาวุธ

source: Produces weapons out of iron.
th: ผลิตอาวุธจากเหล็ก.

source: Weaver's Hut
th: กระท่อมคนทอผ้า

source: Turns lamb wool into cloth.
th: เปลี่ยนขนแกะให้กลายเป็นผ้า.

source: Windmill
th: กังหันลม

source: Grinds corn into flour.
th: บดข้าวโพดไปเป็นแป้ง.

source: Winery
th: โรงกลั่นไวน์

source: Produces wine out of grapes.
th: ผลิตไวน์จากองุ่น.

source: Wooden Tower
th: หอคอยไม้

source: Defends your settlement.
th: ป้องกันอาณานิคมของคุณ.

source: Companies
th: ส่วนการผลิต

source: Fields
th: พื้นที่การเกษตร

source: Military
th: การทหาร

source: Mining
th: การทำเหมือง

source: Residents and infrastructure
th: ผู้อยู่อาศัยและโครงสร้างพื้นฐาน

source: Services
th: บริการ

source: Citizens
th: ประชากร

source: Food
th: อาหาร

source: Fortifications
th: ป้อมปราการ

source: Infrastructure
th: โครงสร้างพื้นฐาน

source: Military Service
th: การเกณฑ์ทหาร

source: Pioneers
th: ผู้บุกเบิก

source: Precaution
th: การเฝ้าระวัง

source: Residential
th: ที่อยู่อาศัย

source: Sea
th: ทะเล

source: Wood
th: ไม้

source: Workshops
th: โรงปฏิบัติงาน

source: Settlement
th: การตั้งถิ่นฐาน

source: Agriculture
th: การเกษตร

source: Failed to start/load the game
th: ไม่สามารถ เริ่ม/โหลด เกมได้.

source: The game you selected could not be started.
th: เกมที่คุณเลือกไม่สามารถเริ่มได้.

source: The savegame might be broken or has been saved with an earlier version.
th: ไฟล์เซฟเกมอาจเสียหายหรือถูกบันทึกด้วยเวอร์ชั่นก่อนหน้าที่เก่ากว่ามาก.

source: No quicksaves found
th: ไม่พบบันทึกอย่างรวดเร็ว.

source: You need to quicksave before you can quickload.
th: คุณต้องบันทึกอย่างรวดเร็วก่อนจึงจะสามารถโหลดได้อย่างรวดเร็ว.

source: Logging enabled
th: เปิดใช้งานการบันทึก

source: Logs are written to {directory}.
th: บันทึกจะถูกเขียนลงใน {directory}.

source: The games have run out of sync. This indicates an unknown internal error, the game cannot continue.
th: เกมหลุดออกจากการซิงค์ ข้อความนี้ระบุถึงข้อผิดพลาดภายในที่ไม่รู้จัก เกมไม่สามารถดำเนินการต่อไปได้.

source: We are very sorry and hope to have this bug fixed in a future version.
th: เราเสียใจมากและหวังว่าจะสามารถแก้ไขข้อบกพร่องนี้ได้ในรุ่นต่อไป.

source: Not possible
th: เป็นไปไม่ได้

source: Save/load for multiplayer games is not possible yet
th: ไม่สามารถ บันทึก/โหลด เกมแบบหลายผู้เล่นได้ในตอนนี้

source: The filename must consist only of letters, numbers, spaces and these characters: _ . -
th: ชื่อไฟล์จะต้องประกอบด้วยตัวอักษร, ตัวเลข, ช่องว่าง และตัวอักษรต่อไปนี้เท่านั้น: _ . -

source: Unable to connect to server.
th: ไม่สามารถเชื่อมต่อกับเซิร์ฟเวอร์.

source: Maybe invalid or irresolvable server address.
th: อาจเป็นที่อยู่ของเซิร์ฟเวอร์ที่ไม่ถูกต้องหรือไม่สามารถแก้ไขที่อยู่ได้.

source: Not Ready
th: ยังไม่พร้อม

source: Old or unsupported multiplayer protocol. Please check your game version
th: รูปแบบของโปรโตคอลแบบหลายผู้เล่นเก่าเกินไปหรือไม่ได้รับการสนับสนุน โปรดตรวจสอบเวอร์ชั่นเกมของคุณ.

source: You've exceeded the global packet size.
th: แพ็คเกจโดยรวมทั่วไปของคุณมีขนาดเกินกว่าที่กำหนด.

source: This should never happen. Please contact us or file a bug report.
th: สิ่งนี้ไม่ควรเกิดขึ้น กรุณาติดต่อเราหรือรายงานข้อผิดพลาดที่เกิดขึ้นนี้.

source: You've exceeded the per packet size.
th: คุณมีขนาดต่อแพ็คเกจเกินขนาด.

source: Unknown or malformed packet. Please check your game version
th: แพ็คเกจที่ไม่รู้จักหรือผิดรูปแบบ โปรดตรวจสอบเวอร์ชั่นเกมของคุณ.

source: Invalid/Unknown session
th: เซสชั่น ไม่ถูกต้อง/ไม่รู้จัก

source: You can't join a game while in another game
th: คุณไม่สามารถเข้าร่วมเกมได้ในขณะที่กำลังเล่นอยู่ในเกมอื่น.

source: Unknown game or game is running a different version
th: เกมที่ไม่รู้จักหรือเกมที่กำลังใช้งานเป็นเกมเวอร์ชั่นอื่น.

source: Game has already started. No more joining
th: เกมได้เริ่มขึ้นแล้ว ไม่สามารถเข้าร่วมได้อีก.

source: Game is full
th: เกมเต็มแล้ว.

source: Wrong password
th: รหัสผ่านไม่ถูกต้อง.

source: There's already a player with your name inside this game.
th: มีผู้เล่นที่ใช้ชื่อเดียวกันกับคุณอยู่ในเกมนี้แล้ว.

source: Please change your name.
th: โปรดเปลี่ยนชื่อของคุณ.

source: There's already a player with your color inside this game.
th: มีผู้เล่นที่มีสีเดียวกับที่คุณเลือกอยู่ในเกมนี้แล้ว.

source: Please change your color.
th: โปรดเปลี่ยนสีของคุณ.

source: There's already a player with your unique player ID inside this game. This should never occur.
th: มีผู้เล่นที่มีหมายเลขไอดีผู้เล่นซ้ำกันกับไอดีของคุณอยู่ในเกมนี้แล้ว โดยปรกติสิ่งนี้ไม่ควรเกิดขึ้น.

source: You are not inside a game
th: คุณไม่ได้อยู่ในเกม.

source: Unable to change your name.
th: ไม่สามารถเปลี่ยนชื่อของคุณ.

source: Unable to change your color.
th: ไม่สามารถเปลี่ยนสีของคุณ.

source: You can't fetch a game while in another game
th: คุณไม่สามารถดึงเกม ในขณะที่คุณกำลังอยู่ในเกมอื่น.
