Repository: btdn/unknown-horizons
Catalog: po/uh/*.po
Languages: th

source: The game has been terminated. The creator has left the game.
th: เกมดังกล่าวถูกยกเลิก ผู้สร้างเกมได้ออกจากเกมไปแล้ว.

source: One player has terminated their game. For technical reasons, this currently means the game cannot continue. We are very sorry about that.
th: มีผู้เล่นคนหนึ่งได้ยกเลิกการเล่นเกมครั้งนี้แล้ว ด้วยเหตุผลทางเทคนิคหมายความว่าในขณะนี้เกมไม่สามารถดำเนินการต่อไปได้ เราเสียใจเป็นอย่างยิ่งเกี่ยวกับเรื่องนี้.

source: You have won!
th: คุณชนะ!

source: You have completed this scenario.
th: คุณได้ทำเนื้อเรื่องนี้เสร็จสมบูรณ์แล้ว.

source: Do you want to continue playing?
th: คุณต้องการเล่นต่อหรือไม่?

source: unknown
th: ไม่ทราบ

source: Failed to create savegame file
th: ไม่สามารถสร้างไฟล์เซฟเกม

source: There has been an error while creating your savegame file.
th: เกิดข้อผิดพลาดในขณะที่สร้างไฟล์เซฟเกมของคุณ.

source: This usually means that the savegame name contains unsupported special characters.
th: อาจเป็นไปได้ว่าชื่อของไฟล์เซฟเกมมีอักขระพิเศษที่ไม่รองรับ.

source: Access is denied
th: การเข้าถึงถูกปฏิเสธ

source: The savegame file could be read-only or locked by another process.
th: ไฟล์เซฟเกมอาจเป็นแบบอ่านได้อย่างเดียวหรือกำลังถูกล็อกจากโปรเซสอื่น.

source: Your game has not been saved.
th: เกมของคุณยังไม่ได้รับการบันทึก.

source: New version of Unknown Horizons
th: เวอร์ชั่นใหม่ของ Unknown Horizons

source: There is a more recent release of Unknown Horizons ({new_version}) than the one you are currently using ({old_version}).
th: มีตัวเกม Unknown Horizons เวอร์ชั่นล่าสุด ({new_version}) ซึ่งเป็นรุ่นใหม่กว่าที่คุณใช้อยู่ในขณะนี้ ({old_version}).

source: Click to download
th: คลิกเพื่อดาวน์โหลด

source: A page has been opened in your browser.
th: จะมีการเปิดหน้าเว็บไซต์ในเบราว์เซอร์ของคุณ.

source: {slotnum} slots, {limit}t
th: {slotnum} ช่อง, {limit}ตัน

source: Health: {health}
th: สุขภาพ: {health}

source: This building must be built on an island.
th: สิ่งปลูกสร้างนี้จะต้องสร้างบนเกาะ.

source: This ground is not suitable for this building.
th: พื้นที่นี้ไม่เหมาะสำหรับสิ่งปลูกสร้างนี้.

source: This building has to be built within your settlement.
th: สิ่งปลูกสร้างนี้จะต้องสร้างขึ้นภายในอาณานิคมของคุณ.

source: This area is already occupied by another player.
th: บริเวณนี้ถูกครอบครองโดยผู้เล่นอื่นแล้ว.

source: This area is already occupied by another building.
th: บริเวณนี้ถูกครอบครองโดยสิ่งปลูกสร้างอื่นแล้ว.

source: This area is already occupied by a unit.
th: พื้นที่นี้ถูกครอบครองโดยยูนิต.

source: This building must be built on the coastline.
th: สิ่งปลูกสร้างนี้จะต้องสร้างบนชายฝั่ง.

source: This building has to be placed at the ocean.
th: สิ่งปลูกสร้างนี้จะต้องถูกวางไว้ในมหาสมุทร.

source: This spot is too far away from your ship.
th: จุดนี้อยู่ไกลจากเรือของคุณมากเกินไป.

source: This building can only be built on a resource source.
th: สิ่งปลูกสร้างนี้สามารถสร้างได้บนแหล่งทรัพยากรเท่านั้น.

source: You have already settled this island.
th: คุณได้ตั้งถิ่นฐานที่เกาะนี้ไปแล้ว.

source: This building must be partly on flat land.
th: สิ่งปลูกสร้างนี้จะต้องสร้างอยู่บนพื้นที่ราบ.

source: The inhabitants are infected by the Black Death!
th: ผู้อยู่อาศัยได้รับเชื้อไข้ดำ!

source: This building is on fire!
th: อาคารหลังนี้กำลังถูกไฟไหม้!

source: These residents are unhappy.
th: ผู้อยู่อาศัยเหล่านี้ไม่มีความสุข.

source: These residents don't have access to a main square.
th: ผู้อยู่อาศัยเหล่านี้ไม่สามารถเข้าถึงจัตุรัสหลักได้.

source: The inventory of this building is full.
th: ช่องเก็บของในอาคารหลังนี้เต็มแล้ว.

source: This building has a very low productivity.
th: อาคารหลังนี้มีผลผลิตที่ต่ำมาก.

source: This building is decommissioned.
th: อาคารหลังนี้ถูกรื้อถอน.

source: Trade route: going to {location}
th: เส้นทางการค้า: กำลังไปยัง {location}

source: Trade route: waiting at {position}
th: เส้นทางการค้า: กำลังรออยู่ที่ {position}

source: Going to {location}
th: กำลังไปที่ {location}

source: Going to {x}, {y}
th: กำลังไปที่ {x}, {y}

source: Idle at {location}
th: อยู่นิ่งๆที่ {location}

source: Idle at {x}, {y}
th: อยู่นิ่งๆที่ {x}, {y}

source: Trader
th: พ่อค้า

source: Attacking {target} '{name}' ({owner})
th: ทำการโจมตี {target} '{name}' ({owner})

source: Attacking {owner}
th: ทำการโจมตี {owner}

source: Your game has been autosaved.
th: เกมของคุณถูกบันทึกอัตโนมัติ.

source: Your building has caught fire!
th: สิ่งปลูกสร้างของคุณถูกไฟไหม้!

source: {player1} and {player2} have ended their alliance and are now in a state of war.
th: {player1} และ {player2} ได้ยุติการเป็นพันธมิตรของพวกเขาและขณะนี้อยู่ในภาวะสงคราม.

source: {player1} and {player2} have terminated their alliance.
th: {player1} กับ {player2} ได้ยกเลิกการเป็นพันธมิตรของพวกเขา.

source: {player1} and {player2} have ended the war and are now allied.
th: {player1} และ {player2} ได้ยุติสงครามและเป็นพันธมิตรกันแล้ว.

source: {player1} and {player2} have settled their hostility.
th: {player1} กับ {player2} ได้ตัดสินความเป็นศัตรูของพวกเขา.

source: {player1} and {player2} have allied their forces.
th: {player1} กับ {player2} มีกองกำลังพันธมิตรของพวกเขา.

source: {player1} and {player2} will fight each other to the death.
th: {player1} กับ {player2} จะสู้กันเองจนกว่าจะตายกันไปข้าง.

source: You can also drag roads.
th: คุณสามารถลากถนนได้.

source: One of your fields requires a farm to harvest its crops.
th: หนึ่งในพื้นที่ทางการเกษตรของคุณต้องการฟาร์มเพื่อเก็บเกี่ยวพืชผล.

source: Your mine has run out of resources.
th: เหมืองของคุณไม่มีทรัพยากรเหลือแล้ว.

source: You have reached the current maximum tier. Your inhabitants will not upgrade further.
th: คุณมาถึงระดับสูงสุดในปัจจุบัน ผู้อยู่อาศัยของคุณจะไม่อัพเกรดอีกต่อไป.

source: Cannot go here.
th: ไม่สามารถไปที่นี่.

source: Your crew refuses to leave this map.
th: ลูกเรือของคุณปฏิเสธที่จะออกจากแผนที่นี้.

source: You need more {resource} to build this building.
th: คุณต้องการ {resource} มากกว่านี้เพื่อสร้างสิ่งปลูกสร้างนี้.

source: A new settlement was founded by {player}.
th: อาณานิคมใหม่ถูกก่อตั้งขึ้นโดย {player}.

source: A new ship by the name of {name} has been created.
th: เรือใหม่ที่ชื่อ {name} ถูกต่อสำเร็จแล้ว.

source: The Soldier by the name of {name} is ready to battle.
th: ทหารที่ชื่อ {name} พร้อมที่จะออกรบ.

source: The inhabitant by the name of {name} is available.
th: ผู้อยู่อาศัยที่ใช้ชื่อ {name} นั้นมีอยู่แล้ว.

source: A new world has been created.
th: โลกใหม่ได้ถูกสร้างขึ้น.

source: Some of your inhabitants have no access to a main square.
th: ผู้อยู่อาศัยบางคนของคุณไม่สามารถเข้าถึงจัตุรัสหลักได้.

source: Your game has been quicksaved.
th: เกมของคุณถูกบันทึกอย่างรวดเร็วแล้ว.

source: The route is now configured. Start it via the "start route" button in the "configure route" menu.
th: เส้นทางได้ถูกกำหนดแล้ว คุณสามารถเริ่มใช้งานได้จากปุ่ม "เริ่มเส้นทาง" ในเมนู "กำหนดเส้นทาง".

source: Your game has been saved.
th: เกมของคุณได้รับการบันทึกแล้ว.

source: Screenshot has been saved to {file}.
th: ภาพหน้าจอถูกบันทึกไปที่ {file}.

source: Your inhabitants reached level {level}.
th: ผู้อยู่อาศัยของคุณถึงระดับ {level}.

source: Some of your inhabitants just moved out.
th: ชาวเมืองบางคนเพิ่งย้ายออกไป.

source: You cannot tear the warehouse, your settlements needs it.
th: คุณไม่สามารถรื้อถอนคลังสินค้าได้ อาณานิคมของคุณต้องใช้มัน.

source: You won!
th: คุณชนะ!

source: You failed the scenario.
th: คุณล้มเหลวในบทเนื้อเรื่อง.

source: The inhabitants of this building are infected by the Black Death!
th: ผู้ที่อาศัยอยู่ในอาคารหลังนี้กำลังติดเชื้อไข้ดำ!

source: coins
th: เหรียญ

source: lamb wool
th: ขนแกะ

source: textile
th: สิ่งทอ

source: boards
th: ไม้กระดาน

source: food
th: อาหาร

source: tools
th: เครื่องมือ

source: bricks
th: ก้อนอิฐ

source: trees
th: ต้นไม้

source: grass
th: หญ้า

source: wool
th: ขนสัตว์

source: faith
th: ความเชื่อ

source: deer food A
th: อาหารกวาง

source: deer meat
th: เนื้อกวาง

source: happiness
th: ความสุข

source: potatoes
th: มันฝรั่ง

source: education
th: การศึกษา

source: sugar cane
th: ต้นอ้อย

source: sugar
th: น้ำตาล

source: community
th: ชุมชน

source: clay deposit
th: ฝากดิน

source: clay
th: ดิน

source: liquor
th: เหล้าหวาน

source: charcoal
th: ถ่าน

source: iron deposit
th: ฝากเหล็ก

source: iron ore
th: แร่เหล็ก

source: iron ingots
th: แท่งเหล็ก

source: get-together
th: งานสังสรรค์

source: fish
th: ปลา

source: salt
th: เกลือ

source: tobacco plants
th: ต้นยาสูบ

source: tobacco leaves
th: ใบยาสูบ

source: tobaccos
th: ยาสูบ

source: cattle
th: วัว

source: pigs
th: หมู

source: cattle for slaughter
th: วัวเพื่อเชือด

source: pigs for slaughter
th: หมูเพื่อเชือด

source: herbs
th: สมุนไพร

source: medical herbs
th: สมุนไพรทางการแพทย์

source: acorns
th: ลูกโอ๊ก

source: cannon
th: ปืนใหญ่

source: sword
th: ดาบ

source: grain
th: เมล็ดข้าว

source: corn
th: ข้าวโพด

source: flour
th: แป้ง

source: spice plants
th: ต้นเครื่องเทศ

source: spices
th: เครื่องเทศ

source: condiments
th: เครื่องปรุงรส

source: marble deposit
th: ฝากหินอ่อน

source: marble tops
th: เนื้อหินอ่อน

source: coal deposit
th: ฝากถ่านหิน

source: stone deposit
th: ฝากหิน

source: stone tops
th: เนื้อหิน

source: cocoa beans
th: เมล็ดโกโก้

source: cocoa
th: โกโก้

source: confectionery
th: ลูกกวาด

source: candles
th: เทียน

source: vines
th: เถาองุ่น

source: grapes
th: องุ่น

source: alvearies
th: กรงผึ้ง

source: honeycombs
th: รังผึ้ง

source: gold deposit
th: ฝากทอง

source: gold ore
th: แร่ทอง

source: gold ingots
th: แท่งทอง

source: gem deposit
th: ฝากอัญมนี

source: rough gems
th: อัญมณีหยาบ

source: gems
th: อัญมณี

source: coffee plants
th: ต้นกาแฟ

source: coffee beans
th: เมล็ดกาแฟ

source: coffee
th: กาแฟ

source: tea plants
th: ต้นชา

source: tea leaves
th: ใบชา

source: tea
th: ชา

source: flower meadows
th: ทุ่งดอกไม้

source: blossoms
th: บุปผชาติ

source: brine deposit
th: ฝากน้ำเกลือ

source: brine
th: น้ำเกลือ

source: whales
th: ปลาวาฬ

source: ambergris
th: อำพันขี้ปลาวาฬ

source: lamp oil
th: ตะเกียงน้ำมัน

source: cotton plants
th: ต้นฝ้าย

source: cotton
th: ฝ้าย

source: indigo plants
th: ต้นสกุลคราม

source: indigo
th: สกุลคราม

source: garments
th: เสื้อผ้า

source: perfume
th: น้ำหอม

source: hop plants
th: ต้นฮอปส์

source: hops
th: ฮอปส์

source: beer
th: เบียร์

source: hygiene
th: สุขภาพ

source: recreation
th: นันทนาการ

source: blackdeath
th: ไข้ดำ(กาฬโรค)

source: fire
th: ไฟ

source: Sailors
th: กะลาสี

source: Merchants
th: วาณิช

source: Aristocrats
th: ผู้ดี
