Repository: btdn/unknown-horizons
Catalog: po/uh/*.po
Languages: th

source: Thank you for using Unknown Horizons!
th: ขอบคุณที่ใช้งาน Unknown Horizons!

source: Unknown Horizons has crashed.
th: Unknown Horizons เกิดข้อผิดพลาด.

source: We are very sorry for this and want to fix the underlying error.
th: เราเสียใจอย่างยิ่งสำหรับสิ่งที่เกิดขึ้นนี้ และต้องการแก้ไขข้อผิดพลาดพื้นฐาน.

source: In order to do this, we need the information from the logfile:
th: เพื่อที่จะทำการแก้ปัญหานี้ได้เราต้องการข้อมูลจากไฟล์บันทึกข้อผิดพลาด:

source: Please give it to us via IRC or our forum, for both see http://unknown-horizons.org .
th: โปรดส่งไฟล์ดังกล่าวให้กับเราผ่านทางเครือข่าย IRC หรือที่ฟอรั่ม สำหรับที่อยู่ของทั้งสองแหล่งสามารถดูได้ที่ http://unknown-horizons.org .

source: Return to editor
th: กลับไปที่ตัวแก้ไข

source: Save map
th: บันทึกแผนที่

source: Load map
th: โหลดแผนที่

source: Settings
th: ตั้งค่า

source: Help
th: ช่วยเหลือ

source: Exit editor
th: ออกจากตัวแก้ไข

source: Select brush size:
th: เลือกขนาดแปรง:

source: Select terrain:
th: เลือกภูมิประเทศ:

source: (right click to stop)
th: (คลิกขวาเพื่อหยุด)

source: Game start
th: เริ่มเกม

source: You need to found a settlement before you can construct buildings!
th: คุณต้องตั้งถิ่นฐานก่อนจึงจะสามารถสร้างสิ่งปลูกสร้างได้!

source: Select your ship and approach the coast via right-click.
th: เลือกเรือของคุณแล้วเข้าไปใกล้ชายฝั่งด้วยการคลิกขวา.

source: Afterwards, press the large button in the ship overview tab.
th: หลังจากนั้นกดปุ่มขนาดใหญ่ในแถบภาพรวมของเรือ.

source: Build
th: สร้าง

source: Running costs:
th: ค่าใช้จ่ายในการทำงาน:

source: Related buildings
th: สิ่งปลูกสร้างที่เกี่ยวข้อง

source: Inhabitants
th: คนที่อาศัยอยู่

source: Increase game speed ({key})
th: เพิ่มความเร็วของเกม ({key})

source: Decrease game speed ({key})
th: ลดความเร็วของเกม ({key})

source: Rotate map counterclockwise ({key})
th: หมุนแผนที่ทวนเข็มนาฬิกา ({key})

source: Rotate map clockwise ({key})
th: หมุนแผนที่ตามเข็มนาฬิกา ({key})

source: Zoom in
th: ซูมเข้า

source: Zoom out
th: ซูมออก

source: Destroy ({key})
th: ทำลาย ({key})

source: Captain's log ({key})
th: บันทึกของกัปตัน ({key})

source: Build menu ({key})
th: เมนูก่อสร้าง ({key})

source: Diplomacy
th: การทูต

source: Game menu ({key})
th: เมนูเกม ({key})

source: Change name
th: เปลี่ยนชื่อ

source: Old name:
th: ชื่อเดิม:

source: Enter new name:
th: ใส่ชื่อใหม่:

source: Apply the new name
th: นำชื่อใหม่ไปใช้

source: Chat
th: สนทนา

source: Enter your message:
th: ใส่ข้อความของคุณ:

source: Running costs
th: ค่าใช้จ่ายในการทำงาน

source: To build a groundunit, click on one of the class tabs, select the desired groundunit and confirm the order.
th: หากต้องการสร้างยูนิตภาคพื้นดิน คลิกที่หนึ่งในแท็บตามประเภทและเลือกยูนิตที่ต้องการแล้วยืนยันคำสั่ง.

source: Currently building:
th: กำลังสร้าง:

source: Pause
th: หยุดชั่วคราว

source: Resume
th: ดำเนินการต่อ

source: Construction progress:
th: ความคืบหน้าในการก่อสร้าง:

source: Resources still needed:
th: ทรัพยากรที่ยังต้องการ:

source: Cancel building:
th: ยกเลิกการก่อสร้าง:

source: (lose all resources)
th: (เสียทรัพยากรทั้งหมด)

source: Cancel all building progress
th: ยกเลิกความคืบหน้า การก่อสร้างทั้งหมด

source: Confirm order
th: ยืนยันคำสั่ง

source: (like in the selection tabs)
th: (เหมือนในแถบที่เลือก)

source: 24t
th: 24ตัน

source: 14t
th: 14ตัน

source: 06t
th: 06ตัน

source: Sloop-o'-war
th: เรือสงครามสลุบ

source: Three-masted most common classified war ship with one gun deck.
th: เรือสงครามทั่วไปที่มีสามเสากระโดงเรือ พร้อมด้วยปืนใหญ่บนดาดฟ้าเรือหนึ่งกระบอก.

source: Buy Upgrades
th: ซื้อการอัพเกรด

source: Cannons
th: ปืนใหญ่

source: Hull
th: ตัวเรือ

source: + 24t
th: + 24ตัน

source: + 14t
th: + 14ตัน

source: + 06t
th: + 06ตัน

source: Build groundunit:
th: สร้างยูนิตภาคพื้นดิน:

source: Build this groundunit!
th: สร้างยูนิตภาคพื้นดินนี้!

source: To build a boat, click on one of the class tabs, select the desired ship and confirm the order.
th: เพื่อที่จะสร้างเรือให้คลิกที่หนึ่งในแท็บประเภทของเรือและเลือกเรือที่ต้องการแล้วยืนยันคำสั่ง.

source: Build ship:
th: ต่อเรือ:

source: Build this ship!
th: ต่อเรือลำนี้!

source: ally
th: พันธมิตร

source: neutral
th: เป็นกลาง

source: enemy
th: ศตรู

source: Building overview
th: ภาพรวมของสิ่งปลูกสร้าง

source: Capacity utilization
th: ความจุในการใช้ประโยชน์

source: Click to change the name of this groundunit
th: คลิกเพื่อเปลี่ยนชื่อให้กับยูนิตภาคพื้นดินนี้

source: Settlement inventory
th: รายการทรัพย์สินของผู้ตั้งถิ่นฐาน

source: Settler overview
th: ภาพรวมของผู้ตั้งถิ่นฐาน

source: Paid taxes
th: จ่ายภาษี

source: Taxes:
th: ภาษี:

source: Tax rate
th: อัตราภาษี

source: Upgrade permissions:
th: อนุญาตให้อัพเกรด:

source: Happiness per house
th: ความสุขต่อบ้าน

source: sad
th: เศร้า

source: satisfied
th: พึงพอใจ

source: happy
th: มีความสุข

source: Amount of houses with this happiness
th: จำนวนบ้านด้วยความสุขนี้

source: Residents per house
th: ผู้อยู่อาศัยต่อบ้าน

source: Number of inhabitants per house
th: จำนวนผู้อยู่อาศัยต่อบ้าน

source: Houses with this amount of inhabitants
th: บ้านที่มีจำนวนผู้อยู่อาศัยนี้

source: Summary
th: ภาพรวม

source: houses
th: บ้าน

source: residents
th: ผู้อยู่อาศัย

source: Provides security for your settlement.
th: ให้ความปลอดภัยสำหรับการตั้งถิ่นฐานของคุณ.

source: Selling
th: จัดจำหน่าย

source: Buying
th: ซื้อหา

source: Name:
th: ชื่อ:

source: Weapons:
th: อาวุธ:

source: Resource deposit
th: สะสมทรัพยากร

source: This is a resource deposit where you can build a mine to dig up resources.
th: นี่คือการสะสมทรัพยากรที่ที่คุณสามารถสร้างเหมืองเพื่อขุดหาทรัพยากร.

source: It contains these resources:
th: มันมีทรัพยากรเหล่านี้:

source: Click to change the name of your settlement
th: คลิ๊กเพื่อเปลี่ยนชื่อให้กับการตั้งถิ่นฐานของคุณ

source: Happiness
th: ความสุข

source: Residents
th: ผู้อยู่อาศัย

source: Needed resources:
th: ทรัพยากรที่ต้องการ:

source: The signal fire shows the free trader how to reach your settlement in case you want to buy or sell goods.
th: สัญญาณไฟที่ใช้เพื่อนำทางให้กับพ่อค้าอิสระเพื่อที่พวกเขาจะได้มีจุดสังเกตว่า สามารถเข้าถึงบริเวณที่ตั้งถิ่นฐานของคุณได้อย่างไรในกรณีที่คุณต้องการจะซื้อหรือขายสินค้า.

source: This is the free trader's ship. It will visit you from time to time to buy or sell goods.
th: นี่คือเรือของพ่อค้าอิสระ พวกเขาจะมาเยี่ยมคุณเป็นครั้งคราวเพื่อซื้อหรือขายสินค้า.

source: Click to change the name of this ship
th: คลิกเพื่อเปลี่ยนชื่อให้กับเรือนี้

source: Trade
th: แลกเปลี่ยน

source: Build settlement
th: สร้างผู้ตั้งถิ่นฐาน

source: Configure trading route
th: ตั้งค่าเส้นทางการค้า

source: Discard all resources
th: ละทิ้งทรัพยากรทั้งหมด

source: Ship:
th: เรือ:

source: Exchange:
th: แลกเปลี่ยน:

source: Trade partner:
th: คู่ค้า:

source: Buy or sell resources
th: ซื้อหรือขายทรัพยากร

source: Trade history
th: ประวัติการแลกเปลี่ยน

source: Select resources:
th: เลือกทรัพยากร:

source: Collector utilization
th: ใช้ประโยชน์จากการสะสม

source: Income:
th: รายรับ:

source: Taxes
th: ภาษี

source: Sale
th: ขาย

source: Expenses:
th: ค่าใช้จ่าย:

source: Balance:
th: ความสมดุล:

source: Show resources produced in this settlement
th: แสดงทรัพยากรที่ผลิตในนิคมนี้

source: Pause production
th: หยุดการผลิตชั่วคราว

source: Start production
th: เริ่มการผลิต

source: Select resource:
th: เลือกทรัพยากร:

source: The resource you select is displayed instead of the current one. Empty by clicking on X.
th: ทรัพยากรที่คุณเลือกจะถูกแสดงแทนทรัพยากรปัจจุบัน ทำให้ว่างโดยคลิกที่ X.

source: Save current resource configuration as default for all settlements.
th: บันทึกการตั้งค่าทรัพยากรปัจจุบันเป็นค่าเริ่มต้นให้กับนิคมทั้งหมด.

source: Reset default resource configuration for all settlements.
th: รีเซ็ตการตั้งค่าทรัพยากรเริ่มต้นสำหรับนิคมทั้งหมด.

source: Move up
th: ย้ายขึ้น

source: Delete entry
th: ลบรายการ

source: Move down
th: ย้ายลง

source: Read previous entries
th: อ่านรายการก่อนหน้า

source: Read next entries
th: อ่านรายการถัดไป

source: Statistics
th: สถิติ

source: Players
th: ผู้เล่น

source: My ships
th: เรือของฉัน

source: My settlements
th: นิคมของฉัน

source: Game messages
th: ข้อความจากเกม

source: Whole world
th: ทั่วโลก

source: Everybody
th: ทุกคน

source: Sends the chat messages to all players.
th: ส่งข้อความสนทนาให้กับผู้เล่นทั้งหมด.

source: Enter your message here
th: กรอกข้อความของคุณที่นี่.

source: Return to game
th: กลับเข้าเกม

source: Island Name:
th: ชื่อเกาะ:

source: Player Name:
th: ชื่อผู้เล่น:

source: Wait at load:
th: รอโหลดของขึ้น:

source: Wait at unload:
th: รอโหลดของลง:

source: Select a resource:
th: เลือกทรัพยากร:

source: Route activity:
th: กิจกรรมตามเส้นทาง:

source: Start route
th: เริ่มเส้นทาง

source: Exit
th: ออก

source: Go to previous page
th: ไปยังหน้าที่ผ่านมา

source: Go to next page
th: ไปยังหน้าถัดไป

source: Close
th: ปิด

source: Player scores
th: คะแนนของผู้เล่น

source: Name
th: ชื่อ

source: Player Name
th: ชื่อผู้เล่น

source: Money
th: เงิน

source: Player's current treasury + income expected in near future
th: คลังปัจจุบันของผู้เล่น + รายได้ที่คาดว่าจะเกิดขึ้นในอนาคต

source: Land
th: พื้นดิน

source: Value of usable land i.e Amount of Land that can be used to create buildings
th: มูลค่าของที่ดินที่สามารถใช้งานได้ เช่น.จำนวนที่ดินที่สามารถใช้ในการสร้างสิ่งปลูกสร้าง

source: Resources
th: ทรัพยากร

source: Value of resources generated from all the possible sources in the player's settlement(s)
th: มูลค่าของทรัพยากรที่สร้างจากแหล่งที่เป็นไปได้ทั้งหมดในการตั้งถิ่นฐานของผู้เล่น

source: Buildings
th: สิ่งปลูกสร้าง

source: Value of all the buildings in the player's settlement(s)
th: มูลค่าของสิ่งปลูกสร้างทั้งหมดในการตั้งถิ่นฐานของผู้เล่น

source: Settlers
th: ผู้ตั้งถิ่นฐาน

source: Value denoting the progress of the settlement(s) in terms of inhabitants, buildings and overall happiness
th: ค่าที่แสดงถึงความคืบหน้าในการตั้งถิ่นฐาน ในแง่ของผู้อยู่อาศัย, สิ่งปลูกสร้างและความสุขโดยรวม

source: Units
th: ยูนิต

source: Value of all the units owned by the player
th: มูลค่าของยูนิตทั้งหมดที่ผู้เล่นเป็นเจ้าของ

source: The total value from all individual entities or in short : Total Player Score
th: มูลค่ารวมจากเอกลักษณ์ของแต่ละบุคคลโดยย่อ: คะแนนผู้เล่นทั้งหมด

source: Total
th: ทั้งหมด

source: Balance
th: ความสมดุล

source: Type
th: ประเภท

source: Weapons
th: อาวุธ

source: Health
th: สุขภาพ

source: Status
th: สถานะ

source: Aggressive
th: ความก้าวร้าว

source: Hold ground
th: ยึดพื้นที่

source: Passive
th: ไม่โต้ตอบ

source: Flee
th: หลบหนี

source: Exit to main menu
th: ออกไปยังเมนูหลัก

source: Choose a map size:
th: เลือกขนาดแผนที่:

source: Choose a map:
th: เลือกแผนที่:

source: Choose a saved game's map:
th: เลือกแผนที่ของเกมที่บันทึกไว้:

source: Select map source
th: เลือกแหล่งแผนที่

source: Create new map
th: สร้างแผนที่ใหม่

source: Load existing map
th: โหลดแผนที่ที่มีอยู่

source: Load saved game's map
th: โหลดแผนที่ของเกมที่บันทึกไว้

source: Start editor
th: เริ่มเครื่องมือแก้ไข

source: Return
th: ย้อนกลับ

source: Actions
th: การกระทำ

source: Scroll left
th: เลื่อนไปทางซ้าย

source: Scroll right
th: เลื่อนไปทางขวา

source: Scroll up
th: เลื่อนไปข้างบน

source: Scroll down
th: เลื่อนลงข้างล่าง

source: Rotate building or map clockwise
th: หมุนสิ่งปลูกสร้างหรือแผนที่ตามเข็มนาฬิกา

source: Rotate building or map counterclockwise
th: หมุนสิ่งปลูกสร้างหรือแผนที่ทวนเข็มนาฬิกา

source: Increase game speed
th: เพิ่มความเร็วของเกม

source: Decrease game speed
th: ลดความเร็วของเกม

source: Pause game
th: หยุดเกมชั่วคราว

source: Show build menu
th: แสดงเมนูก่อสร้าง

source: Enable destruct mode
th: เปิดใช้โหมดทำลาย

source: Enable road building mode
th: เปิดใช้โหมดสร้างถนน

source: Enable pipette mode (clone buildings)
th: เปิดใช้โหมดหลอดดูดสี (โคลนอาคาร)

source: Show player scores
th: แสดงคะแนนของผู้เล่น

source: Show settlement list
th: แสดงรายการการอาณานิคม

source: Show ship list
th: แสดงรายการเรือ

source: Toggle Captain's log
th: สลับบันทึกของกัปตัน

source: Quicksave
th: เซฟแบบรวดเร็ว

source: Quickload
th: โหลดแบบรวดเร็ว

source: Toggle translucency of ambient buildings
th: สลับความโปร่งแสงของสิ่งปลูกสร้างโดยรอบ

source: Highlight tile ownership
th: เน้นช่องที่เป็นเจ้าของ

source: Toggle health bars
th: สลับแถบสุขภาพ

source: Focus camera on selection
th: กล้องโฟกัสเมื่อมีการเลือก

source: Remove selected units / buildings
th: ลบยูนิต/อาคารที่เลือก

source: Display help
th: แสดงความช่วยเหลือ

source: Screenshot
th: ภาพหน้าจอ

source: Toggle showing FPS on/off
th: สลับการเปิด/ปิด FPS

source: Toggle grid on/off
th: สลับเปิด/ปิดเส้นกริด

source: Show coordinate values (Debug)
th: แสดงค่าพิกัด (ดีบั๊ก)

source: Primary
th: เบื้องต้น

source: Secondary
th: สำรอง

source: Reset to default
th: รีเซ็ตเป็นค่าเริ่มต้น

source: Reset to default keys
th: รีเซ็ตเป็นปุ่มเริ่มต้น

source: Save game
th: เซฟเกม

source: Load game
th: โหลดเกม

source: Cancel game
th: ยกเลิกเกม

source: Loading…
th: กำลังโหลด…

source: Change Background
th: เปลี่ยนรูปพื้นหลัง

source: Singleplayer
th: เล่นคนเดียว

source: Multiplayer
th: เล่นหลายคน

source: Quit
th: ออก

source: Editor
th: ตัวแก้ไข

source: Credits
th: เครดิต

source: Create game - Multiplayer
th: สร้างเกม - ผู้เล่นหลายคน

source: Player limit:
th: จำกัดจำนวนผู้เล่น:

source: Exit to multiplayer menu
th: ออกไปยังเมนูผู้เล่นหลายคน

source: Name of the game:
th: ชื่อของเกม:

source: This will be displayed to other players so they recognize the game.
th: สิ่งนี้จะปรากฏต่อผู้เล่นคนอื่นๆเพื่อให้พวกเขาจดจำเกมได้.

source: Unnamed Game
th: เกมที่ไม่มีชื่อ

source: Password of the game:
th: รหัสผ่านสำหรับเกม:

source: This game's password. Required to join this game.
th: รหัสผ่านของเกมนี้ ต้องกรอกเพื่อเข้าร่วมเกมนี้.

source: Create this new game
th: สร้างเกมนี้ใหม่

source: Gamelobby
th: ล็อบบี้ของเกม

source: Chat:
th: สนทนา:

source: Exit gamelobby
th: ออกจากเกมล็อบบี้

source: The game will start as soon as all players are ready.
th: เกมจะเริ่มทันทีที่ผู้เล่นทุกคนพร้อม.

source: Game details:
th: รายละเอียดของเกม:

source: Color
th: สี

source: Ready:
th: ความพร้อม:

source: Sets your state to ready (necessary for the game to start)
th: ตั้งค่าสถานะความพร้อมของคุณ (จำเป็นสำหรับเริ่มต้นเกม)

source: New game - Multiplayer
th: เกมใหม่ - ผู้เล่นหลายคน

source: Load game:
th: โหลดเกม:

source: Load a saved game
th: โหลดเกมที่บันทึกไว้

source: Active games:
th: เกมที่ใช้งานอยู่:

source: Refresh list:
th: รีเฟรชรายการ:

source: Refresh list of active games
th: รีเฟรชรายการเกมที่ใช้งานอยู่

source: Create game:
th: สร้างเกม:

source: Create a new game
th: สร้างเกมใหม่

source: Join game:
th: เข้าร่วมเกม:

source: Join the selected game
th: เข้าร่วมเกมที่ได้เลือก

source: Change player details
th: เปลี่ยนรายละเอียดของผู้เล่น

source: Graphics
th: กราฟิก

source: Screen resolution:
th: ความละเอียดหน้าจอ:

source: Full screen:
th: เต็มหน้าจอ:

source: Frame rate limit:
th: จำกัดเฟรมเรท:

source: Set the maximum frame rate used. Default: 60 fps.
th: กำหนดอัตราเฟรมสูงสุดที่จะใช้. ค่าเริ่มต้น: 60 fps.

source: Sound
th: เสียงประกอบ

source: Music volume:
th: ความดังของเพลง:

source: Effects volume:
th: ความดังของเอ็ฟเฟ็ค:

source: Enable sound:
th: เปิดใช้เสียง:

source: Mouse
th: เม้าส์

source: Scroll at map edge:
th: เลื่อนที่บริเวณขอบแผนที่:

source: Whether to move the viewport when the mouse pointer is close to map edges
th: กำหนดว่าต้องการจะย้ายส่วนที่มองเห็นหรือไม่ เมื่อตัวชี้เม้าส์อยู่ที่บริเวณขอบของแผนที่

source: Cursor centered zoom:
th: เคอร์เซอร์ซูมอยู่ตรงกลาง:

source: When enabled, mouse wheel zoom will use the cursor position as new viewport center. When disabled, always zoom to current viewport center.
th: เมื่อเปิดใช้งานการซูมด้วยล้อเลื่อนของเมาส์จะใช้ตำแหน่งเคอร์เซอร์เป็นจุดศูนย์กลางของส่วนที่มองเห็นใหม่ และเมื่อปิดใช้งานให้ซูมไปที่ศูนย์กลางของส่วนที่มองเห็นปัจจุบันเสมอ.

source: Middle mouse button pan:
th: เลื่อนด้วยปุ่มกลางของเมาส์:

source: When enabled, dragging the middle mouse button will pan the camera
th: เมื่อเปิดใช้งาน การลากด้วยปุ่มกลางของเมาส์จะเป็นการกวาดมุมกล้อง

source: 0 is default system settings
th: 0 เป็นการตั้งค่าเริ่มต้นของระบบ

source: Mouse sensitivity:
th: ความไวของเมาส์:

source: Saving
th: เก็บรักษา

source: Autosave interval in minutes:
th: ช่วงเวลาบันทึกอัตโนมัติเป็นนาที:

source: Number of autosaves:
th: จำนวนบันทึกอัตโนมัติ:

source: Number of quicksaves:
th: จำนวนของเซฟอย่างรวดเร็ว:

source: Language
th: ภาษา

source: General
th: ทั่วไป

source: Rotate minimap with map:
th: หมุนแผนที่ย่อพร้อมแผนที่:

source: Whether to also rotate the minimap whenever the regular map is rotated
th: กำหนดว่าจะหมุนแผนที่ย่อด้วยหรือไม่เมื่อมีการหมุนแผนที่ปกติ

source: Uninterrupted building:
th: ปลูกสร้างอย่างต่อเนื่อง:

source: When enabled, do not exit the build mode after successful construction
th: เมื่อเปิดใช้งาน จะไม่ออกจากโหมดก่อสร้างหลังจากที่สร้างเสร็จ

source: Auto-unload ship:
th: โหลดลงจากเรือโดยอัตโนมัติ:

source: Whether to unload the ship after founding a settlement
th: กำหนดว่าจะโหลดลงจากเรือหรือไม่หลังจากที่ตั้งอาณานิคม

source: Don't use in normal game session. Decides whether to write debug information in the logging directory of your user directory. Slows the game down.
th: อย่าใช้ในเซสชั่นเกมปกติ มันจะเป็นการตัดสินใจว่าจะต้องเขียนข้อมูลการดีบักลงในไดเร็กทอรีสำหรับบันทึกที่อยู่ในไดเร็กทอรีผู้ใช้ของคุณหรือไม่ ซึ่งจะทำให้เกมทำงานช้าลง.

source: Enable logging:
th: เปิดใช้งานการบันทึก:

source: Production indicators:
th: ตัวชี้วัดการผลิต:

source: Whether to show resource icons over buildings whenever they finish production
th: กำหนดว่าต้องการจะแสดงไอคอนทรัพยากรเหนือสิ่งปลูกสร้างทุกครั้งที่ผลิตเสร็จหรือไม่

source: Higher values slow down scrolling.
th: ค่าที่สูงขึ้นจะทำให้การเลื่อนได้ช้าลง.

source: Scroll delay:
th: หน่วงเวลาการเลื่อน:

source: Choose a quote type:
th: เลือกประเภทคำพูด:

source: What kind of quote to display while loading a game
th: ชนิดของคำพูดอ้างอิงที่จะให้แสดงในขณะโหลดเกม

source: Network
th: เครือข่าย

source: If set to 0, use the router default
th: หากตั้งค่าเป็น 0, จะใช้ค่าเริ่มต้นของเราเตอร์

source: Network port:
th: พอร์ตเครือข่าย:

source: Discard current changes
th: ยกเลิกการเปลี่ยนแปลงปัจจุบัน

source: Reset to default settings
th: รีเซ็ตเป็นค่าเริ่มต้น

source: Save changes
th: บันทึกการเปลี่ยนแปลง

source: Your saved games:
th: เกมที่คุณเซฟไว้:

source: Password of the game. Required to join this game
th: รหัสผ่านของเกม ต้องกรอกเพื่อขอเข้าร่วมเกมนี้

source: Cancel
th: ยกเลิก

source: Enter filename:
th: กรอกชื่อไฟล์:

source: Details:
th: รายละเอียด:

source: Delete selected savegame
th: ลบเซฟเกมที่เลือก

source: New game - Singleplayer
th: เกมใหม่ - เล่นคนเดียว

source: Scenario
th: โหมดเนื้อเรื่อง

source: Random map
th: สุ่มแผนที่

source: Free play
th: เล่นแบบอิสะ

source: Start game
th: เริ่มเกม

source: Choose a map to play:
th: เลือกแผนที่เพื่อเล่น:

source: Map settings:
th: ตั้งค่าแผนที่:

source: Seed:
th: เมล็ดพันธุ์:

source: Select a language:
th: เลือกภาษา:

source: AI players:
th: ผู้เล่น AI:

source: Game settings:
th: ตั้งค่าเกม:

source: Free Trader
th: พ่อค้าอิสระ

source: Pirates
th: โจรสลัด

source: Disasters
th: ภัยพิบัติ

source: Player name:
th: ชื่อผู้เล่น:

source: Color:
th: สี:

source: Invalid filename
th: ชื่อไฟล์ไม่ถูกต้อง

source: Received an invalid filename for a save command.
th: ได้รับชื่อไฟล์ที่ไม่ถูกต้องสำหรับคำสั่งในการบันทึก.

source: Error
th: ข้อผิดพลาด

source: Failed to save.
th: ไม่สามารถบันทึก.

source: The trade partner does not sell this.
th: คู่ค้าจะไม่ขายสินค้าชนิดนี้.

source: You can not store this.
th: คุณไม่สามารถเก็บสิ่งนี้ได้.

source: You can not afford to buy this.
th: คุณไม่สามารถที่จะซื้อสิ่งนี้.

source: The trade partner does not sell more of this.
th: คู่ค้าจะไม่ขายสินค้านี้มากขึ้น.

source: The trade partner does not buy this.
th: คู่ค้าจะไม่ซื้อสินค้านี้.

source: You do not possess this.
th: คุณไม่ได้ครอบครองสิ่งนี้.

source: The trade partner can not store more of this.
th: คู่ค้าไม่สามารถจัดเก็บสินค้าชนิดนี้ได้มากกว่านี้.

source: The trade partner can not afford to buy this.
th: คู่ค้าไม่สามารถซื้อสิ่งนี้.

source: The trade partner does not buy more of this.
th: คู่ค้าจะไม่ซื้อสินค้าชนิดนี้มากขึ้น.

source: Failed to quicksave.
th: ไม่สามารถบันทึกอย่างรวดเร็ว.

source: An error happened during quicksave.
th: มีข้อผิดพลาดเกิดขึ้นระหว่างบันทึกอย่างรวดเร็ว.

source: Your map has not been saved.
th: แผนที่ของคุณยังไม่ได้รับการบันทึก.

source: If this error happens again, please contact the development team: {website}
th: หากข้อผิดพลาดนี้เกิดขึ้นอีกโปรดติดต่อทีมพัฒนา: {website}

source: Are you sure you want to quit Unknown Horizons?
th: คุณแน่ใจหรือไม่ว่าต้องการที่จะออกจาก Unknown Horizons?

source: Quit Game
th: ออกจากเกม

source: No diplomacy possible
th: ไม่มีการเจรจาต่อรองที่เป็นไปได้

source: Cannot do diplomacy as there are no other players.
th: ไม่สามารถทำการเจรจาต่อรองเนื่องจากไม่มีผู้เล่นอื่น.

source: Are you sure you want to delete these objects?
th: คุณแน่ใจหรือว่าต้องการลบวัตถุเหล่านี้?

source: Delete
th: ลบทิ้ง

source: {size}x{size} tiles
th: {size}x{size} ช่อง

source: Press key…
th: กดคีย์…

source: {key} is already set to {action}.
th: {key} ถูกตั้งให้กับ {action} ไปแล้ว.

source: Would you like to overwrite it?
th: คุณต้องการจะเขียนทับมันหรือไม่?

source: Confirmation for overwriting
th: ยืนยันการเขียนทับ

source: Quotes
th: คำคม

source: Gameplay Tips
th: เคล็ดลับการเล่นเกม

source: Press 'ESC' to access Game Menu.
th: กด 'ESC' เพื่อเข้าถึงเมนูเกม.

source: Use 'SHIFT' to place multiple buildings.
th: ใช้ 'SHIFT' เพื่อวางสิ่งปลูกสร้างหลายแห่ง.

source: Currently only the first {tier} tiers are playable.
th: ขณะนี้มีเพียง {tier} ระดับแรกเท่านั้นที่สามารถเล่นได้.

source: You can pause the game with 'P'.
th: คุณสามารถหยุดเกมชั่วคราวด้วยการกด 'P'.

source: You can drag roads by holding the left mouse button.
th: คุณสามารถลากถนนโดยการกดปุ่มซ้ายของเมาส์ค้างไว้.

source: You can build multiple buildings by holding the 'SHIFT' key.
th: คุณสามารถสร้างอาคารหลายหลังได้โดยกดปุ่ม 'SHIFT'.

source: You can increase the happiness of your inhabitants by lowering the taxes.
th: คุณสามารถเพิ่มความสุขให้กับผู้อยู่อาศัยของคุณได้โดยการลดหย่อนภาษี.

source: Build fire stations and doctors to protect your inhabitants from fire and disease.
th: สร้างสถานีดับเพลิงและแพทย์ เพื่อปกป้องผู้อยู่อาศัยจากเหตุไฟไหม้และโรคร้าย.

source: Build storage tents to increase your storage capacity.
th: สร้างเต็นท์เก็บของเพื่อเพิ่มพื้นที่เก็บทรัพยากรของคุณ.

source: Make sure every house is in range of a marketplace.
th: ตรวจสอบให้แน่ใจว่าบ้านทุกหลังอยู่ในช่วงระยะของตลาด.

source: Press 'T' to make trees transparent.
th: กด 'T' เพื่อทำให้ต้นไม้โปร่งใส.

source: Build storage tents and lookouts to expand your settlement range.
th: สร้างเต๊นท์เก็บของและสถานีเฝ้าระวัง เพื่อช่วยขยายระยะการตั้งถิ่นฐานของคุณ.

source: To easily see whether the pavilion's range cover all your tents, select it from the build menu and hover it over your existing pavilion. Uncovered tents are shown in yellow. It's a good idea to build a new pavilion in their neighborhood.
th: หากต้องการดูว่าช่วงของศาลาครอบคลุมเต็นท์ทั้งหมดของคุณหรือไม่ ให้เลือกจากเมนูสร้างและวางเมาส์เหนือศาลาที่คุณมีอยู่ เต๊นท์ที่ไม่มีหลังคาจะแสดงเป็นสีเหลือง เป็นความคิดที่ดีที่จะสร้างศาลาใหม่ในละแวกบ้านของพวกเขา.

source: Make singleplayer more fun with additional computer players by increasing 'AI players' when starting a new game.
th: ทำให้การเล่นคนเดียวสนุกยิ่งขึ้นด้วยผู้เล่นที่เป็นคอมพิวเตอร์ เพิ่มได้โดยการเพิ่ม 'ผู้เล่น AI' เมื่อเริ่มเกมใหม่.

source: First steps are easier by looking at how AI players are setting up their settlement.
th: ขั้นตอนแรกนั้นง่ายโดยการดูว่าผู้เล่นที่เป็น AI ตั้งค่าการตั้งถิ่นฐานของพวกเขาอย่างไร.

source: Want funny quotes only? Change the quote types shown here in the settings menu on the game page.
th: ต้องการเฉพาะคำพูดตลกๆเท่านั้นหรือ? เปลี่ยนประเภทคำพูดที่แสดงที่นี่ได้ในหน้าเมนูการตั้งค่าของเกม.

source: A marketplace links your buildings like a road.
th: ตลาดเชื่อมโยงสิ่งปลูกสร้างของคุณเช่นเดียวกับถนน.

source: Mixed
th: ผสม
