Repository: btdn/unknown-horizons
Catalog: po/scenarios/*/The_Unknown.po
Languages: ar, id, th

source: easy
ar: سهل
id: mudah
th: ง่าย

source: You are the captain of a ship under the flag of England in 1740. You and your crew were on the way to a colony of England in the Pacific Ocean. Everything went fine until you came into a storm…
ar: أ،ت قائد سفينة انجليزية بعام 1740.كنت انت وطاقمك متوجهون الى مستعمرة في المحيط الهادئ الى أن حلت العاصفة…
id: Kamu adalah Kapten kapal dibawah bendera Inggris pada 1740. Kamu dan para kru dalam perjalanan menuju daerah jajahan Inggris di Samudera Pasifik. Semuanya baik-baik saja hingga kamu tiba dalam badai…
th: ในปี 1740 คุณได้ทำหน้าที่เป็นกัปตันของเรือภายใต้ธงชาติของอังกฤษ คุณและลูกเรือกำลังเดินเรือไปยังอาณานิคมของอังกฤษในมหาสมุทรแปซิฟิก ทุกอย่างดูเหมือนจะเรียบร้อยดีจนกระทั่งคุณเดินเรือเข้าไปในเขตของพายุ…

source: 20th November 1740
ar: 20 نوفمبر 1740
id: 20 November 1740
th: 20 พฤศจิกายน ค.ศ. 1740

source: After four days the storm finally fades and we can take a rest. But we only have little food left and our ship is in a bad shape. The navigational instruments and sea charts are lost.
ar: زالت العاصفة بعد اربعة ايام أخيرا يمكننا الراحة. لكن طاعم كاد يفنذ والسفينة بحال يرثى لها. فقدنا ادوات الملاحة والخرائط .
id: Setelah empat hari, badai sepenuhnya menghilang dan kita dapat beristirahat. Tapi kita hanya memiliki sedikit makanan dan kapal kita sudah hampir rusak. Alat navigasi dan peta laut juga hilang.
th: หลังจากที่ได้พยายามมาตลอดสี่วันในที่สุดพายุก็จางหายไปและเราก็สามารถพักผ่อนกันได้ แต่เราเหลืออาหารเพียงเล็กน้อยและเรือของเราอยู่ในสภาพที่ไม่ค่อยดี เครื่องมือนำทางและแผนภูมิทางทะเลหายไปแล้ว.

source: We have to come ashore soon. One of my jacks saw some birds hunting for fish, so land can't be far. Fortunately we always have some tools and boards onboard, so we can build some basic shelter.
ar: يجب أن نصل الشاطئ قريبا. أحد المراقبين لمح طيرا يصطاد سمكا، لابد أن اليابسة قريبة. لحسن الحظ لدينا بعض الألواح والأدوات لبناء ملاجئ بسيطة.
id: Kita akan tiba sesaat lagi. Salah satu jack milikku melihat sekawanan burung berburu ikan, jadi ada pulau tidak jauh dari sini. Untungnya kita selalu sedia beberapa peralatan dan papan di kapal, jadi kita dapat membangun tempat berlidung dasar.
th: เราคงต้องรีบกลับขึ้นฝั่งในเร็วๆนี้ กะลาสีเรือคนหนึ่งของฉันเห็นนกออกมาหาปลาดังนั้นน่าจะมีพื้นดินอยู่ไม่ไกล โชคดีที่เราเตรียมเครื่องมือและแผ่นกระดานสำรองไว้อยู่เสมอ ทำให้เราสามารถสร้างที่พักอาศัยขั้นพื้นฐานบางอย่างขึ้นมาได้.

source: Task: Find land and build a port.
ar: المهمة: إبحث عن أرض لبناء الميناء.
id: Tugas: Carilah sebuah pulau dan bangun pelabuhan.
th: งานที่ต้องทำ: มองหาชายฝั่งแล้วสร้างท่าเทียบเรือ.

source: 22nd November 1740
ar: 22 نوفمبر 1740
id: 22 November 1740
th: 22 พฤศจิกายน ค.ศ. 1740

source: The port is built and a new hope arises. I am still worried about the next days… we are running out of food and lack basic building material.
ar: بُنيَ الميناء وبدأ أمل جديد. أنا قلق من الأيام القادمة... نحن نفتقر الى المواد الأساسية والغذاء بدأ بالنفاذ.
id: Pelabuhan telah dibangun dan sebuah harapan kembali muncul. Aku masih khawatir tentang hari-hari yang akan datang…kita akan kehabisan makanan dan kekurangan bahan-bahan dasar untuk membangun bangunan.
th: ท่าเทียบเรือถูกสร้างขึ้นและก็มีความหวังใหม่เกิดขึ้นด้วยพร้อมกัน ฉันยังคงกังวลเกี่ยวกับวันต่อๆไป… เราไม่มีอาหารเหลือแล้วและกำลังขาดวัสดุก่อสร้างขั้นพื้นฐาน.

source: We need to secure our basic needs to keep us alive. It is time to send people gathering food and lumber so that we can survive and build some shelter.
ar: علينا تأمين أساسيات الحياة. حان الوقت لإرسال الناس لجمع الغذاء والخشب اللازمين لنجاة وبناء المآوي.
id: Kita harus mengamankan keperluan dasar kita untuk bertahan hidup. Ini waktunya untuk mengutus seorang untuk mengumpulkan makanan dan papan kayu, jadi kita dapat bertahan hidup dan membangun tempat berlindung.
th: เราจำเป็นต้องรักษาความต้องการขั้นพื้นฐานของเราให้ปลอดภัย ถึงเวลาที่จะต้องส่งคนออกไปรวบรวมอาหารและตัดไม้นำมาแปรรูป เพื่อให้เราสามารถอยู่รอดและสร้างที่พักอาศัยชั่วคราวได้.

source: Task: Build at least one of each: * Lumberjack * Fisher * Hunter Collect 5 food and 5 boards.
ar: المهمة: إبني واحد على الأقل من كل من: *حطاب *صائد سمك * صياد إجمع 5 من الغذاء و5 ألواح.
id: Tugas: Bangun setidaknya satu dari setiap: *Penebang Pohon *Nelayan *Pemburu Kumpulkan 5 makanan dan 5 papan.
th: งานที่ต้องทำ: สร้างสิ่งต่อไปนี้อย่างละหนึ่งแห่ง: * คนตัดไม้ * คนหาปลา * คนล่าสัตว์ เก็บอาหาร 5 หน่วยและไม้กระดาน 5 แผ่น.

source: 25th November 1740
ar: 25 نوفمبر 1740
id: 25 November 1740
th: 25 พฤศจิกายน ค.ศ. 1740

source: We have secured our basic needs of food and gathered some wood to continue the growth of our new settlement. Our people demand a place to live and exchange goods for their everyday needs.
ar: قمنا بتأمين إحتياجاتنا الأساسية من الغذاء وجمعنا بعض الحطب اللازم لنمو مستعمرتنا. شعبنا يطالب بمكان للمبيت ولتبادل إحتياجاتهم من السلع.
id: Kita sudah mengamankan kebutuhan dasar makanan dan mengumpulkan beberapa kayu untuk melanjutkan membangun pemukiman kita yang baru. Penduduk kita meminta tempat untuk hidup sehari-hari dan kebutuhan mereka.
th: เราได้รับน้ำและอาหารตามความต้องการขั้นพื้นฐานแล้ว และกำลังรวบรวมไม้บางส่วนเพื่อนำมาใช้สร้างที่พักอาศัยหลังใหม่ภายในนิคม คนของเราต้องการสถานที่อยู่อาศัยและแลกเปลี่ยนสินค้าสำหรับความต้องการในชีวิตประจำวันของพวกเขา.

source: It is time to build some tents to live in and a small main square to supply our citizens with goods.
ar: حان الوقت لبناء الخيم للعيش وساحة رئيسية لتزويد مواطنينا بالسلع.
id: Ini waktunya untuk membangun perkemahan untuk hidup dan pasar yang kecil untuk menyalurkan kebutuhan penduduk kita.
th: ถึงเวลาสร้างเต็นท์เพื่อพักอาศัยและสร้างจัตุรัสเล็กๆ เพื่อให้คนของเราได้รับสิ่งของที่พวกเขาต้องการ.

source: Task: Build a Main Square and at least 10 Tents.
ar: المهمة: إبني ساحة رئيسية و 10 خيم على الأقل.
id: Tugas: Bangunlah sebuah pasar kecil dan setidaknya 10 perkemahan.
th: งานที่ต้องทำ: สร้างจัตุรัสหลักและมีเต็นท์อย่างน้อย 10 หลัง.

source: 1st December 1740
ar: 1 ديسمبر 1740
id: 1 Desember 1740
th: 1 ธันวาคม ค.ศ. 1740

source: Finally we have enough to eat and a place to live again. My tent is not very comfortable but it keeps me dry and I have the feeling of having a roof over my head at night.
ar: أخير لدينا مكان للأكل والعيش مجددا. خيمتي ليست مريحة ولكنا تبقيني جافا وتعطيني سقفا يؤيني ليلا.
id: Akhirnya kita memiliki makanan yang cukup dan tempat untuk tinggal lagi. Perkemahanku tidak terlalu nyaman. Tapi, ini dapat menjaga ku tetap hangat dan aku merasa ingin melihat atap diatas kepalaku ketika malam tiba.
th: ในที่สุดเราก็มีเสบียงเหลืออยู่อย่างเพียงพอและสถานที่ที่ทำให้พวกเรามีชีวิตชีวาขึ้นอีกครั้ง เต็นท์ของฉันไม่ค่อยจะสบายสักเท่าไร แต่มันทำให้ฉันตัวแห้งและทำให้รู้สึกได้ว่ามีหลังคาอยู่เหนือหัวในตอนกลางคืนช่วงที่มีน้ำค้างลง.

source: I have been researching the stars at night, but without my sea charts and instruments their meaning remains unknown. I have the feeling we will be stuck here for a while, so we'll have to make the best of situation. We can only try to to build up a civilisation and find a way home…
ar: كنت أتفحص النجوم ليلا، لكن بدون الخرائط وأدوات الملاحة ليس لنجوم معنا. لدي شعور أننا سنعلق هنا طويلا، علينا إستغلال الموقف بأفضل طريقة. ليس لدينا سوى محاولت بناء حضارة وإيجاد المنزل…
id: Aku telah mencari bintang-bintang di malam hari, tapi tanpa peta laut ku dan alat yang tidak diketahui gunanya. Aku merasa kita akan berdiam beberapa saat di sini, jadi kita harus membuat situasi yang baik. Kita dapat mencoba meningkatkan peradaban dan mencari jalan pulang…
th: ฉันค้นคว้าดวงดาวในตอนกลางคืน แต่ถ้าไม่มีแผนภูมิทางทะเลและเครื่องมือพวกมันก็ยังไม่มีความหมาย ฉันมีความรู้สึกว่าเราคงต้องติดกันอยู่ที่นี่ซักพักดังนั้นเราจะต้องทำให้สถานการณ์ดีที่สุด ตอนนี้เราทำได้แค่พยายามสร้างอารยธรรมเล็กๆและหาทางกลับบ้าน…

source: Task: Grow the village until you have at least 250 inhabitants and a positive balance.
ar: المهمة: وسع القرية حتى تحصل على 250 ساكن وتقدير إيجابي.
id: Tugas: Kembangkan desa hingga kamu punya setidaknya 250 penduduk dan Keseimbangan yan Positif.
th: งานที่ต้องทำ: ขยายหมู่บ้านจนกว่าจะมีผู้อยู่อาศัยอย่างน้อย 250 คนและสร้างความสมดุลในเชิงบวก.

source: 27th August 1745
ar: 27 أوت 1745
id: 27 Agustus 1745
th: 27 สิงหาคม ค.ศ. 1745

source: Our village is doing well, the city has grown to over 250 inhabitants. I have started getting used to my new home, but this island is too small to stay here forever.
ar: قريتنا بأفضل حال، نمى عدد سكان المدينة الى أكثر من 250، بدأت بالإعتياد على بيتي الجديد، لكن هذه الجزيرة صغيرة للبقاء فيها طويلا.
id: Desa kita semakin membaik, kota telah tumbuh hingga 250 penduduk. Aki akan mulai menggunakan rumah baruku, tapi pulau ini terlalu kecil untuk tinggal disini selamanya.
th: หมู่บ้านของเราเติบโตได้ดีมาก เมืองนี้มีประชากรมากกว่า 250 คน ฉันเริ่มคุ้นเคยกับบ้านใหม่ของฉันแล้ว แต่เกาะนี้เริ่มจะเล็กเกินไปถ้าจะต้องให้อาศัยอยู่ที่นี่ตลอดไป.

source: We should load our ship and move out to find a bigger island offering room and resources for my people. I have created a basic navigational map again, using the stars I see at night. It is not perfect, but I hope it will suffice to return here.
ar: علينا تحميل السفينة وإيجاد جزيرة أكبر لتوفير إحتياجات الشعب المتزايد، رسمت خريطة بدائية باستخدام النجوم. ليست مثالية، لكن آمل أن تعيدنا لهنا.
id: Kita seharusnya memuat kapal kita dan keluar dari pulau ini untuk mencari pulau yang lebih besar kapasitasnya dan sumberdaya untuk para penduduk. Aku dapat membuat peta navigasi dasar kembali, dengan menggunakan bintang-bintang yang aku lihat malam hari. Ini tidak sempurna, tapi aku harap ini akan cukup membantu kita kembali dari sini.
th: เราควรโหลดเรือของเราและย้ายออกเพื่อค้นหาเกาะที่ใหญ่กว่า ที่ที่มีพื้นที่และทรัพยากรสำหรับคนของฉันอย่างเพียงพอ ฉันสร้างแผนที่การนำทางแบบพื้นฐานใหม่อีกครั้งโดยใช้ดาวที่ได้เห็นในเวลากลางคืน มันไม่ค่อยสมบูรณ์แบบสักเท่าไร แต่ฉันก็หวังว่ามันคงจะเพียงพอที่จะช่วยให้เราได้กลับมาที่นี่.

source: Task: Contact the Unknown Horizons Team (www.unknown-horizons.org) and find out how you can contribute to making this scenario longer and better!
ar: المهمة: تواصل مع فريقUnknown Horizons (www.unknown-horizons.org) وشارك بجعل هذا السيناريو أطول وأفضل!
id: Tugas: Hubungi Tim Unknown Horizon (www.unknown-horizon.org) dan cari bagaimana caranya kamu dapat berkontribusi untuk membuat skenario ini lebih lama dan lebih baik!
th: งานที่ต้องทำ: ติดต่อทีมงาน Unknown Horizons (www.unknown-horizons.org) แล้วค้นหาวิธีที่คุณจะสามารถมีส่วนร่วมในการทำให้เนื้อเรื่องนี้ยาวนานขึ้นและดียิ่งขึ้น!
