Repository: btdn/unknown-horizons
Catalog: po/scenarios/*/tutorial.po
Languages: th

source: Tutorial
th: บทช่วยสอน

source: The tutorial: Build your first settlement and learn how to play!
th: บทช่วยสอน: สร้างนิคมแห่งแรกของคุณแล้วเรียนรู้ถึงวิธีการเล่น!

source: Build a Warehouse on the coast to allow trade ships to visit your settlement.
th: สร้างคลังสินค้าบนชายฝั่งเพื่ออนุญาตให้เรือการค้าเข้ามาแลกเปลี่ยนในถิ่นฐานของคุณ.

source: Welcome to Unknown Horizons!
th: ขอต้อนรับสู่ Unknown Horizons!

source: This is your Journal, where important information about the current scenario is stored. A summary of each new task will also appear as a 'notification button' near the left-hand edge of the screen. You can hover your mouse over these notifications to read the summary, or click the button itself to open the Journal.
th: นี่คือบันทึกของคุณที่เก็บข้อมูลสำคัญเกี่ยวกับสถานการณ์ปัจจุบันไว้ สรุปของงานใหม่แต่ละงานจะปรากฏเป็น 'ปุ่มแจ้งเตือน' ใกล้กับขอบด้านซ้ายของหน้าจอ คุณสามารถเลื่อนเมาส์ไปเหนือการแจ้งเตือนเหล่านี้เพื่ออ่านข้อมูลสรุปหรือคลิกปุ่มเพื่อเปิดบันทึก.

source: You can also re-open the Journal at any time by clicking the button below the mini-map, at the top right of your screen. From now on, we'll refer to this area containing the mini-map, various buttons and tabs as the 'Overview'.
th: คุณสามารถเปิดบันทึกขึ้นมาใหม่ได้ตลอดเวลาโดยคลิกที่ปุ่มด้านล่างของแผนที่ขนาดเล็กที่อยู่ตรงมุมขวาบนของหน้าจอ จากนี้ไปเราจะอ้างอิงถึงพื้นที่เหล่านี้ที่มีอยู่ในแผนที่ย่อ รวมถึงปุ่มและแท็บต่างๆว่าเป็น 'ภาพรวม'.

source: To see your first task, turn to the next page of the Journal using the button at the bottom of the opposite page - it looks like this:
th: หากต้องการดูงานแรกของคุณให้ไปที่หน้าถัดไปของบันทึกโดยใช้ปุ่มที่อยู่บริเวณด้านล่างของหน้า - มีลักษณะที่คล้ายแบบนี้:

source: If you have any suggestions about how this tutorial can be improved, or if you encounter any errors, please tell us.
th: หากคุณมีข้อเสนอแนะใดๆ เกี่ยวกับวิธีการปรับปรุงบทช่วยสอนนี้ หรือหากว่าคุณพบข้อผิดพลาดโปรดบอกเรา.

source: Visit www.unknown-horizons.org to find out how to contact the team.
th: เข้าไปที่ www.unknown-horizons.org เพื่อดูว่าจะสามารถติดต่อเราผ่านทางช่องทางไหนได้บ้าง.

source: And now, let's start the game!
th: และตอนนี้เรามาเริ่มเกมกันเถอะ!

source: NEW TASK: CREATE A SETTLEMENT
th: งานใหม่: สร้างอาณานิคม

source: Your ship is at sea, loaded with the supplies you'll need to establish a new settlement.
th: เรือของคุณกำลังลอยลำอยู่ในทะเล และเต็มไปด้วยทรัพยากรที่คุณต้องการเพื่อใช้สร้างอาณานิคมใหม่.

source: To move your ship, select it with a left-click then right-click on the location you want it to sail to.
th: เพื่อที่จะแล่นเรือของคุณให้เลือกเรือด้วยการคลิกซ้าย แล้วหลังจากนั้นให้คลิกขวาที่ตำแหน่งที่คุณต้องการให้เรือแล่นไป.

source: Once you're near the coast, the 'Build Settlement' button in the overview will become active.
th: เมื่อคุณแล่นเข้าใกล้ชายฝั่งปุ่มสำหรับ 'สร้างถิ่นฐาน' ในแผงภาพรวมจะสามารถใช้งานได้.

source: Clicking this button will show a preview of the Warehouse, the first building required to found a new settlement. As you move the cursor around, you'll notice that the preview is shaded red when the building is in an unsuitable area.
th: คลิกที่ปุ่มนี้จะแสดงตัวอย่างของคลังสินค้า ซึ่งเป็นสิ่งปลูกสร้างแรกที่จำเป็นในการค้นพบถิ่นฐานใหม่ ในขณะที่คุณเลื่อนเคอร์เซอร์ไปรอบๆ คุณจะสังเกตเห็นว่าภาพตัวอย่างเป็นสีแดงเมื่ออาคารอยู่บนพื้นที่ที่ไม่เหมาะสม.

source: The Warehouse needs to be positioned on the coast to allow ships to dock. So, find a good location then left-click to place this important building.
th: คลังสินค้าจะต้องถูกวางลงบนตำแหน่งชายฝั่งเพื่อให้เรือสามารถจอดเทียบท่าได้ ลองค้นหาสถานที่ที่เหมาะสมแล้วหลังจากนั้นให้คลิกซ้ายเพื่อวางสิ่งปลูกสร้างที่สำคัญนี้.

source: Task: Build a Warehouse on the coast.
th: งาน: สร้างคลังสินค้าบนชายฝั่ง.

source: Build a Lumberjack's Tent and connect it to the Warehouse.
th: สร้างเต็นท์ที่พักสำหรับคนตัดไม้แล้วเชื่อมต่อไปยังคลังสินค้าด้วยถนน.

source: NEW TASK: BUILD A LUMBERJACKS TENT
th: งานใหม่: สร้างเต็นท์ที่พักสำหรับคนตัดไม้

source: The supplies and construction materials have been unloaded from your ship and safely stored in your new Warehouse. Now it's time to construct some basic buildings, beginning with a Lumberjack's Tent.
th: เสบียงและวัสดุสำหรับงานก่อสร้างถูกขนถ่ายจากเรือและเก็บไว้อย่างปลอดภัยในคลังสินค้าใหม่ของคุณ ตอนนี้ถึงเวลาที่จะสร้างสิ่งปลูกสร้างพื้นฐานเริ่มต้นกันด้วยเต็นท์สำหรับคนตัดไม้.

source: Lumberjacks will fell trees from the woodland around their tent and process the timber to produce boards, for use in construction or as a trade resource.
th: คนตัดไม้จะล้มต้นไม้จากป่ารอบๆเต็นท์ของพวกเขา แล้วแปรรูปท่อนไม้เพื่อผลิตเป็นไม้กระดานไว้สำหรับใช้ในการก่อสร้างหรือเป็นทรัพยากรสำหรับการค้า.

source: To build a Lumberjack's Tent, open the Build Menu by clicking the button below the mini map or pressing 'B', the default hotkey.
th: เพื่อที่จะสร้างเต็นท์สำหรับคนตัดไม้ เปิดเมนูสำหรับสร้างโดยคลิกที่ปุ่มที่อยู่บริเวณใต้แผนที่ย่อหรือกดคีย์ลัด 'B' ซึ่งเป็นคีย์ลัดเริ่มต้น.

source: The Build Menu is sorted by tiers and, as yours is a new settlement, First Tier buildings are the only ones available to you; as your civilization advances, you will obtain access to higher tiers and be able to construct a much wider range of buildings.
th: เมนูสำหรับก่อสร้างจะถูกจัดเรียงตามระดับและเนื่องจากคุณเป็นชุมชนใหม่สิ่งปลูกสร้างชั้นหนึ่งจึงเป็นสิ่งเดียวที่มีให้คุณในขณะนี้ เมื่ออาณานิคมของคุณก้าวหน้าคุณจะได้รับการเข้าถึงระดับที่สูงขึ้นและสามารถสร้างสิ่งปลูกสร้างได้หลากหลายมากยิ่งขึ้น.

source: Find a nice wooded area for our Lumberjack to work then select 'Lumberjack's Tent' from the list of buildings in the Overview and place the building.
th: ลองหาพื้นที่ป่าสวยๆสำหรับคนตัดไม้ของเราเพื่อให้พวกเขาได้ทำงาน จากนั้นเลือก 'เต็นท์สำหรับคนตัดไม้' จากรายการสิ่งปลูกสร้างในแผงภาพรวมแล้ววางสิ่งปลูกสร้างลงบริเวณที่คุณเลือก.

source: Later in the game you might want to create woodland by planting trees, but since that costs money, you should use what nature has provided for the time being!
th: เมื่อระยะเวลาในเกมผ่านไปคุณอาจต้องสร้างป่าด้วยการปลูกต้นไม้ชุดใหม่เพิ่มขึ้นมา แต่เนื่องจากมันต้องมีค่าใช้จ่ายคุณควรใช้สิ่งที่ธรรมชาติได้จัดเตรียมไว้ให้ในตอนนี้!

source: Any resource-gathering or production building needs a path connecting it to a Warehouse or other form of storage, otherwise the goods it produces will not be collected.
th: การรวบรวมทรัพยากรหรือการสร้างจากการผลิตจำเป็นต้องมีถนนที่เชื่อมต่อกับคลังสินค้าหรือพื้นที่จัดเก็บรูปแบบอื่น มิฉะนั้นสินค้าที่ผลิตออกมาใหม่จะไม่ถูกเก็บรวบรวม.

source: So, once your Lumberjack's Tent is in position, connect it to your Warehouse by opening the Build Menu then clicking the 'Path' button. You can now click and drag with the mouse to draw the route of your path between the Lumberjack's Tent and the Warehouse.
th: ดังนั้นเมื่อเต็นท์สำหรับคนตัดไม้ของคุณถูกสร้างอยู่ในตำแหน่งที่ต้องการแล้ว ให้ทำการเชื่อมต่อเต็นท์กับคลังสินค้าโดยเปิดเมนูสร้างแล้วหลังจากนั้นคลิกปุ่ม 'เส้นทาง' ในขั้นตอนนี้คุณสามารถคลิกและลากด้วยเมาส์เพื่อวาดเส้นทางระหว่างเต็นท์ของคนตัดไม้ไปยังคลังสินค้า.

source: Task: Build a Lumberjack's Tent in a wooded area and connect it to your Warehouse.
th: งาน: สร้างเต็นท์สำหรับคนตัดไม้ในพื้นที่ป่าแล้วเชื่อมต่อไปยังคลังสินค้าของคุณ.

source: Once the buildings are connected you'll see a collector arrive to pick up your newly produced boards and deliver them to the Warehouse, ready for use in construction or trade.
th: เมื่อเชื่อมต่อสิ่งปลูกสร้างเข้าด้วยกันเสร็จแล้วคุณจะเห็นคนงานมารับกระดานที่ถูกสร้างขึ้นมาใหม่ แล้วจัดส่งไปยังคลังสินค้าเพื่อเตรียมความพร้อมสำหรับการนำไปใช้งานในการก่อสร้างหรือการแลกเปลี่ยน.

source: Build a Hunter's Tent and a Fisherman's Tent. Connect them to the Warehouse.
th: สร้างเต็นท์สำหรับคนล่าสัตว์และคนตกปลา แล้วหลังจากนั้นให้เชื่อมต่อพวกมันกับคลังเก็บของ.

source: NEW TASK: FOOD SUPPLY
th: งานใหม่: การจัดหาอาหาร

source: You will need to have some food-producing companies too, because people in general (and especially sailors) are very hungry.
th: คุณจำเป็นต้องมีแหล่งผลิตอาหารด้วย เพราะคนทั่วไป(โดยเฉพาะกะลาสี)มักจะเป็นพวกหิวมาก.

source: Available companies in the first tier are the Hunter's Tent and Fisherman's Tent.
th: แหล่งผลิตอาหารที่มีอยู่ในขั้นแรกคือเต็นท์ของคนล่าสัตว์และเต็นท์ของคนตกปลา.

source: The hunter hunts animals in the forest, thus needs trees nearby.
th: คนล่าสัตว์ต้องล่าสัตว์ที่อาศัยอยู่ในป่า ดังนั้นจึงต้องการต้นไม้อยู่รอบๆหรืออยู่ใกล้ๆกับเต็นท์.

source: Note that you can place your Hunter's Tent close to the lumberjack's forest.
th: โปรดทราบว่าคุณสามารถวางเต็นท์ของคนล่าสัตว์ให้อยู่ใกล้กับเต็นท์ของคนตัดไม้ที่อยู่ภายในป่าได้ด้วยเหมือนกัน.

source: It can happen that the animals don't reproduce fast enough or simply hide well.
th: มันมีความเป็นไปได้ที่ฝูงสัตว์อาจเติบโตได้ไม่ทันความต้องการ หรือพวกมันอาจหาที่ใหม่เพื่อหลบซ่อนตัวได้.

source: Conclusion: the Hunter's Tent is not too reliable if you need continuous supply.
th: ข้อสรุป: เต็นท์ของคนล่าสัตว์มีความไม่น่าไว้วางใจมากเกินไป หากคุณต้องการจัดหาอาหารอย่างต่อเนื่อง.

source: The Fisher needs a coastal building site like the Warehouse and a fish school in range.
th: คนหาปลาต้องการพื้นที่สำหรับสร้างสิ่งปลูกสร้างบริเวณชายฝั่งเหมือนกับคลังเก็บของ รวมถึงแหล่งของฝูงปลาที่อยู่ภายในระยะ.

source: He will build a small rowing vessel and catch some fish.
th: พวกเขาจะสร้างเรือพายขนาดเล็กเพื่อใช้สำหรับออกไปจับปลา.

source: This is a very constant supply at the cost of a slightly longer production time per unit of food.
th: นี่อาจต้องใช้เวลาในการจัดหาที่นานมากยิ่งขึ้น และต้องใช้เวลาในการผลิตเพิ่มขึ้นอีกเล็กน้อยสำหรับอาหารในแต่ละหน่วย.

source: A small settlement like yours can use both companies, and you can better balance pros and cons if you see the direct comparison.
th: สำหรับการตั้งถิ่นฐานเล็กๆเช่นคุณในตอนนี้สามารถใช้พวกเขาได้ทั้งสองอย่าง และคุณจะสามารถสร้างความสมดุลระหว่างข้อดีและข้อเสียได้ดีขึ้น.

source: Task: Build a Hunter's Tent and a Fisherman's Tent.
th: งาน: สร้างเต็นท์สำหรับคนล่าสัตว์และคนหาปลา.

source: Don't forget to connect them to your Warehouse with Trails!
th: อย่าลืมที่จะเชื่อมต่อเต็นท์เหล่านั้นเข้ากับคลังของคุณด้วยเส้นทาง!

source: Build a Main Square. Choose an area without many economy buildings.
th: สร้างจัตุรัสหลัก เลือกพื้นที่ที่ไม่มีสิ่งปลูกสร้างทางเศรษฐกิจจำนวนมาก.

source: NEW TASK: MAIN SQUARE
th: งานใหม่: จัตุรัสหลัก

source: Your residents need a main square where they can fetch their goods from.
th: ผู้อยู่อาศัยของคุณต้องการจัตุรัสหลักสถานที่ที่พวกเขาสามารถรับสิ่งของที่ต้องการได้.

source: This means that they need a trail connection from their home to the Main Square. Note that the Main Square acts as trail as well, therefore adjacent Tents do not need a separate Trail.
th: ซึ่งหมายความว่าพวกมันต้องการเส้นทางการเชื่อมต่อจากบ้านพักอาศัยไปยังจัตุรัสหลัก โปรดทราบว่าจัตุรัสหลักทำหน้าที่คล้ายเส้นทางได้ด้วยเช่นกัน ดังนั้นเต็นท์ที่อยู่ติดกันจึงไม่จำเป็นต้องมีเส้นทางแยก.

source: All goods in your Warehouse are available at this 'market place', so your residents do not need to walk to the Fisherman's Tent or even to the Warehouse.
th: สินค้าทั้งหมดในคลังสินค้าของคุณจะถูกส่งมาที่ 'ตลาด' แห่งนี้ ดังนั้นผู้อยู่อาศัยจึงไม่จำเป็นต้องเดินไปที่เต็นท์ของคนหาปลาหรือแม้แต่ไปที่คลังสินค้าโดยตรง.

source: You should avoid placing your main settlement tents too close to your lumberjacks because building tents will clear away the trees that your lumberjack needs to produce boards.
th: คุณควรหลีกเลี่ยงการตั้งเต็นท์หลักของคุณไม่ให้อยู่ใกล้กับเต็นท์ของคนตัดไม้มากเกินไป เพราะการสร้างเต็นท์จะเป็นการถากถางพื้นที่แล้วกำจัดต้นไม้ที่คนตัดไม้ต้องการในการสร้างไม้กระดาน.

source: Companies work without being connected to the tents, so you don't need to build a road between the Main Square and e.g. your Lumberjack's Tent.
th: คนงานบางส่วนทำงานได้โดยไม่ต้องเชื่อมต่อกับเต็นท์ ดังนั้นคุณไม่จำเป็นต้องสร้างเส้นทางเชื่อมต่อระหว่างจัตุรัสหลักกับเต็นท์บางอย่าง เช่น เต็นท์สำหรับคนตัดไม้ เป็นต้น.

source: Task: Build a Main Square.
th: งาน: สร้างจัตุรัสหลัก.

source: Now let's have a closer look at the Main Square.
th: ตอนนี้เราลองมาดูที่จัตุรัสหลักแบบใกล้ๆกัน.

source: In the 'Account' tab you get a balance sheet of this island, featuring all costs you pay and all taxes you earn.
th: ในแท็บ 'บัญชี' คุณจะได้รู้ถึงงบดุลของเกาะนี้ ซึ่งประกอบด้วยค่าใช้จ่ายทั้งหมดที่คุณได้จ่ายไปและภาษีทั้งหมดที่คุณได้รับเข้ามา.

source: The items 'Sale' and 'Buy' refer to your trading balance and will be explained later on.
th: รายการ 'ขาย' และ 'ซื้อ' จะอ้างอิงถึงยอดคงเหลือในการซื้อขายของคุณ แต่เราจะอธิบายถึงเรื่องนี้กันในภายหลัง.

source: If your balance is positive, you all-in-all make a profit.
th: หากยอดเงินของคุณเป็นค่าบวก คุณก็จะได้กำไรทั้งหมด.

source: In the different tier overview tabs you can see statistics about your inhabitants. You also set the tier-specific global tax here and allow or deny inhabitants of this tier to upgrade to the next higher one.
th: ในแท็บภาพรวมระดับต่างๆคุณสามารถดูสถิติเกี่ยวกับผู้อยู่อาศัยของคุณ นอกจากนี้คุณยังตั้งภาษีทั่วไปเฉพาะระดับได้ที่นี่และยังสามารถอนุญาตหรือปฏิเสธผู้อยู่อาศัยในระดับนี้ไม่ให้อัพเกรดที่พักเป็นระดับที่อยู่สูงขึ้นไป.

source: Build a Tent and connect it to the Main Square if necessary.
th: สร้างเต็นท์และเชื่อมต่อกับจัตุรัสหลักหากจำเป็น.

source: NEW TASK: RESIDENTIAL BUILDINGS
th: งานใหม่: สร้างที่พักอาศัย

source: Settlers want to have a roof over their heads, else they won't even think of living in your city! You need to provide tents.
th: ผู้ตั้งถิ่นฐานต้องการมีหลังคาคลุมหัวมิฉะนั้นพวกเขาจะไม่คิดถึงการใช้ชีวิตในเมืองของคุณ! ดังนั้นคุณมีหน้าที่ที่จะต้องจัดหาเต็นท์ที่พักเอาไว้รองรับ.

source: Tents are the basic residential buildings. Your inhabitants will want to upgrade it when they reach higher tiers.
th: เต็นท์เป็นที่พักอาศัยขั้นพื้นฐาน ผู้อยู่อาศัยของคุณจะต้องการอัพเกรดเมื่อถึงระดับที่สูงขึ้น.

source: Note that the upgrade of each building requires construction material, like wood for their first upgrade.
th: โปรดทราบว่าการอัพเกรดสิ่งปลูกสร้างแต่ละหลังต้องใช้วัสดุก่อสร้าง เช่นไม้สำหรับการอัพเกรดครั้งแรก.

source: Consider to disable the upgrade if your stock of these materials is low.
th: ลองพิจารณาปิดการใช้งานวัสดุในการอัปเกรด หากว่าสต็อกของวัสดุเหล่านี้อยู่ในระดับต่ำ.

source: Settlers may not look very useful since they will try to consume all goods you produce - but they at least pay taxes, and that's the only way you can make money for now!
th: ผู้ตั้งถิ่นฐานอาจดูไม่ค่อยมีประโยชน์เพราะพวกเขาจะพยายามบริโภคทรัพยากรทั้งหมดที่คุณผลิตได้ - แต่อย่างน้อยพวกเขาก็จ่ายภาษีและนั่นเป็นวิธีเดียวที่คุณสามารถทำเงินได้ในตอนนี้!

source: Task: Build a Tent and connect it to the Main Square if necessary. Tents don't need to be connected to any of the companies.
th: งาน: สร้างเต็นท์และเชื่อมต่อกับจัตุรัสหลักหากว่าจำเป็น เต็นท์ไม่จำเป็นต้องเชื่อมต่อกับแหล่งผลิตใดๆ.

source: Build at least three additional Tents and connect them to the Main Square.
th: สร้างเต็นท์เพิ่มอย่างน้อยสามหลัง แล้วเชื่อมต่อมันเข้ากับจัตุรัสหลัก.

source: Let's have a look at the Tent overview tab.
th: ลองดูที่แถบภาพรวมของเต็นท์.

source: You can see * the happiness of these residents, * the taxes they pay and * the resources they demand.
th: คุณจะเห็นได้ว่ามี * ความสุขของผู้อยู่อาศัยเหล่านี้, * ภาษีที่พวกเขาจ่ายและ * ทรัพยากรที่พวกเขาต้องการ.

source: If their demands are fulfilled, happiness and thus your tax income increase.
th: หากความต้องการของพวกเขาบรรลุผล ความสุขก็จะเพิ่มขึ้นและทำให้รายได้จากภาษีของคุณเพิ่มขึ้นตาม.

source: If not, happiness and income decrease. At some time your residents may get really sour and simply turn their back on your village, leaving behind a decaying ruin.
th: ถ้าไม่, ความสุขและรายได้ก็จะลดลง ในบางครั้งผู้พักอาศัยของคุณอาจมีความไม่พอใจและหันหลังให้กับหมู่บ้าน ทิ้งซากปรักหักพังของที่พักให้ผุกร่อนไปตามเวลา.

source: Note that you can also change the global tax settings here, too.
th: โปรดทราบว่าคุณสามารถเปลี่ยนการตั้งค่าภาษีทั่วไปได้ที่นี่ด้วยเช่นกัน.

source: Task: Build at least three additional Tents.
th: งาน: สร้างเต็นท์เพิ่มอย่างน้อยสามหลัง.

source: TIP: Holding down SHIFT eases constructing multiple buildings of the same kind.
th: เคล็ดลับ: กดปุ่ม SHIFT ค้างเอาไว้จะช่วยให้การสร้างสิ่งปลูกสร้างหลายๆหลังที่เป็นแบบเดียวกันทำได้ง่ายขึ้น.

source: Build a Signal Fire at the coast close to your Warehouse.
th: สร้างไฟสัญญานบริเวณใกล้ๆกับคลังสินค้าของคุณ.

source: NEW TASK: BUILD SIGNAL FIRE
th: งานใหม่: สร้างไฟสัญญาณ

source: Can you see the ship passing your island from time to time? That ship belongs to the Free Trader, one of the first settlers in this archipelago.
th: คุณเห็นเรือแล่นผ่านเกาะของคุณไปเป็นครั้งคราวไหม? เรือเหล่านั้นบางลำอาจเป็นของพ่อค้าอิสระซึ่งอาจเป็นของหนึ่งในผู้ตั้งถิ่นฐานคนแรกๆในหมู่เกาะนี้.

source: The trader will supply your settlement with necessary goods which you can't produce yet.
th: พวกพ่อค้าจะช่วยสนับสนุนการตั้งถิ่นฐานของคุณ ด้วยสินค้าที่จำเป็นซึ่งคุณยังไม่สามารถผลิตได้.

source: You can also sell surpluses of your production, but in general consuming them (by building more Tents) instead of selling them yields more profit.
th: คุณยังสามารถขายทรัพยากรที่เป็นส่วนเกินจากการผลิตของคุณได้ แต่โดยทั่วไปคุณควรเก็บพวกมันเอาไว้ใช้งาน (โดยการสร้างเต็นท์เพิ่ม) แทนที่จะขายพวกมันเพื่อแลกกับผลกำไรเล็กๆน้อยๆ.

source: Normally the trader just sails around and looks for deals, but you can speed things up a bit.
th: โดยปกติพ่อค้าจะแล่นเรือไปรอบๆแล้วมองหาข้อตกลง แต่คุณสามารถเพิ่มความเร็วให้กับบางสิ่งได้เล็กน้อย.

source: For this purpose, build a Signal Fire at the coast near your Warehouse. It will show ships the way to your settlement.
th: เพื่อจุดประสงค์นี้สร้างสัญญาณไฟที่ชายฝั่งใกล้กับคลังสินค้าของคุณ มันจะแสดงให้เรือที่แล่นผ่านไปมามุ่งหน้ามาสู่จุดที่คุณได้ตั้งถิ่นฐาน.

source: The Signal Fire has to cover the area which the ships pass through to catch them.
th: สัญญาณไฟจะต้องครอบคลุมพื้นที่เพื่อให้เรือที่ได้แล่นผ่านไปมาได้สะดุดตากับพวกมัน.

source: After this little advertisement, the trader will also stop by and look into your Warehouse, even if he had planned to sail past it.
th: หลังจากมีการส่งสัญญาณเล็กๆนี้ พวกพ่อค้าก็จะแวะเข้ามาดูในคลังสินค้าของคุณ แม้ว่าพวกเขาวางแผนเอาไว้ว่าจะแล่นผ่านไปก็ตาม.

source: You can propose deals via the Warehouse tab "Buy/Sell".
th: คุณสามารถเสนอข้อเสนอต่างๆผ่านแถบคลังสินค้าเพื่อ "ซื้อ/ขาย".

source: At the 'sailors' tier, you are equipped with three trading slots.
th: ที่ระดับ 'ลูกเรือ', คุณมีสามช่องให้ใช้สำหรับการซื้อขาย.

source: Click on the small icon to change the slot mode from 'Buy' to 'Sell' and vice versa.
th: คลิกที่ไอคอนเล็กๆเพื่อเปลี่ยนโหมดของช่องนั้นๆจาก 'ซื้อ' เป็น 'ขาย' หรือในทางกลับกัน.

source: Click in the slot to choose the good you want to trade with. We will further explain this once you are ready to trade.
th: คลิกที่ช่องเพื่อเลือกสิ่งที่คุณต้องการแลกเปลี่ยน เราจะอธิบายเรื่องนี้เพิ่มเติมในอนาคตเมื่อคุณพร้อมที่จะทำการค้า.

source: Task: Build a Signal Fire at the coast close to your Warehouse.
th: งาน: สร้างไฟสัญญาณที่บริเวณใกล้ๆกับคลังสินค้าของคุณ.

source: Reach an island stock of at least 30 tools. Note that this might take a while.
th: ทำการสะสมเครื่องมือบนเกาะอย่างน้อย 30 ชิ้น โปรดทราบว่ามันอาจต้องใช้เวลาสักระยะ.

source: NEW TASK: LEARN TO TRADE
th: งานใหม่: เรียนรู้ที่จะแลกเปลี่ยน

source: Excellent! The Free Trader will now stop by at your Warehouse from time to time. Let's continue our tutorial on how to trade.
th: ยอดเยี่ยม! ในตอนนี้พวกพ่อค้าอิสระจะหยุดดูคลังสินค้าของคุณเป็นครั้งคราว. เรามาเรียนรู้ถึงวิธีการซื้อขายกันต่อดีกว่า.

source: First click on your own Warehouse and click on the third tab.
th: ก่อนอื่นคลิกที่คลังสินค้าของคุณเอง แล้วคลิกที่แถบที่สาม.

source: Then click on one of the 3 slots, then select a good you want to buy or sell.
th: หลังจากนั้นคลิกที่หนึ่งใน 3 ช่อง ต่อจากนั้นเลือกสินค้าที่คุณต้องการจะซื้อหรือขาย.

source: After selecting a particular type of good, the green bar across the bottom of the slot (if visible) shows you how much you have in stock of this good.
th: หลังจากเลือกสินค้าประเภทใดประเภทหนึ่งได้แล้ว จะมีแถบสีเขียวปรากฏขึ้นที่ด้านล่างของช่อง(หากว่ามองเห็น) มันจะแสดงถึงจำนวนของสินค้าที่คุณมีอยู่ในคลัง.

source: Dragging the slider on the right of each slot determines your 'target value' which has a different meaning on 'Buy' and 'Sell'.
th: หากว่าคุณลากตัวเลื่อนทางด้านขวาของแต่ละช่อง จะเป็นการกำหนด 'จำนวนเป้าหมาย' ซึ่งจะมีความหมายแตกต่างกันในระหว่างขั้นตอนการ 'ซื้อ' หรือ 'ขาย'.

source: When buying, you will buy sufficient to hold your 'target value' in stock.
th: เมื่อทำการซื้อ คุณจะซื้อสินค้าประเภทนั้นเข้ามาให้เพียงพอจนถึง 'จำนวนเป้าหมาย' ในสต็อก.

source: When selling, the 'target value' is the stock amount at which you will always stop selling until you get more of that resource again.
th: เมื่อทำการขาย 'จำนวนเป้าหมาย' คือจำนวนในสต็อกที่คุณจะหยุดขายเสมอ จนกว่าคุณจะได้รับทรัพยากรเข้ามาเพิ่มมากขึ้นอีกครั้ง.

source: For example: Having a 'Buy' slot and 5 tons in stock, a slider positioned at 9 tons will cause you to buy 4 additional tons at most.
th: ตัวอย่างเช่น: มีการระบุว่าต้องการ 'ซื้อ' ให้กับช่องและในขณะนั้นมีทรัพยากรประเภทนั้นอยู่ในสต็อกแล้ว 5 ตัน, แถบเลื่อนที่ถูกระบุตำแหน่งไว้ที่ 9 ตันจะทำให้คุณสามารถซื้อเพิ่มเข้ามาได้มากสุดอีก 4 ตันเป็นต้น.

source: Selling works similarly. A 'Sell' slot with 18 tons in stock and the slider positioned at 13 will sell up to 5 tons.
th: ในขั้นตอนการขายก็เป็นอะไรที่คล้ายๆกัน ช่องที่ถูกระบุสถานะว่า 'ขาย' เมื่อขณะนั้นในสต็อกมีอยู่ 18 ตันและแถบเลื่อนถูกระบุเอาไว้ที่ 13 ตันจะเท่ากับว่าต้องการขายออกไป 5 ตันนั่นเอง.

source: If the Free Trader however only wants to buy or sell less than your settings would allow him, you need to live with that and wait for him to return.
th: หากว่าพ่อค้าอิสระต้องการเพียงแค่ซื้อหรือขายในจำนวนที่น้อยกว่าการตั้งค่าที่คุณได้ระบุไว้ คุณจะต้องรอให้พวกพ่อค้ากลับมาซื้อหรือขายใหม่อีกครั้ง.

source: Unknown Horizons features smart pricing, so the value of one unit can vary. It is NOT possible to change prices manually!
th: คุณสมบัติอย่างหนึ่งของ Unknown Horizons จะมีการกำหนดราคาที่ชาญฉลาด ดังนั้นมูลค่าของสินค้าหนึ่งหน่วยจะมีความแตกต่างกัน และไม่สามารถเปลี่ยนแปลงราคาด้วยตนเองได้!

source: You can see your trade balance in the 'Account' tab comparing the 'Sale' and 'Buy' values there.
th: คุณสามารถดูดุลการค้าของคุณได้ในแถบ 'บัญชี' เพื่อเปรียบเทียบมูลค่าระหว่าง 'ขาย' และ 'ซื้อ' ได้ที่นั่น.

source: Task: Buy as many tools as you need to have 30 tools in stock!
th: งาน:ซื้อเครื่องมือให้ได้ครบ 30 ชิ้นในสต็อก!

source: Build a Pavilion with connection to the Tents.
th: สร้างศาลาและเชื่อมต่อเข้ากับเต็นท์ที่พัก.

source: NEW TASK: BUILD A PAVILION
th: งานใหม่: สร้างศาลา

source: Those tools will be enough for the moment. Well done!
th: เรามีเครื่องมือเหล่านั้นสำรองไว้เพียงพอแล้ว ทำได้ดีมาก!

source: You now provide housing, a main square and food to your inhabitants.
th: ตอนนี้คุณได้จัดหาที่อยู่อาศัย, จัตุรัสหลัก และอาหาร ให้กับผู้อยู่อาศัยของคุณเรียบร้อยแล้ว.

source: Still there is one demand which we have not satisfied so far (you may check that by clicking on any Tent): your sailors want a basic building where they can pray.
th: แต่ยังคงมีข้อเรียกร้องเดียวที่เรายังไม่พอใจจนถึงตอนนี้ (คุณสามารถตรวจสอบได้โดยคลิกที่เต็นท์ใดๆ): ลูกเรือของคุณต้องการสิ่งปลูกสร้างพื้นฐานที่พวกเขาสามารถเข้าไปอธิษฐานได้.

source: The solution is a Pavilion which the village parson quickly puts up as shelter from the sun.
th: การแก้ปัญหาเบื้องต้นคือสร้างศาลา ซึ่งคนในหมู่บ้านสามารถทำขึ้นได้อย่างรวดเร็วเพื่อใช้เป็นที่พักพิงหลบแสงจากดวงอาทิตย์.

source: Service buildings like this also need to be connected to the Tents with a Trail, else your inhabitants feel unable to reach them.
th: สิ่งปลูกสร้างประเภทนี้ต้องการเชื่อมต่อกับเต็นท์ที่พักด้วยเส้นทาง ไม่เช่นนั้นผู้อยู่อาศัยของคุณจะไม่สามารถเข้าถึงได้.

source: Note that faith is treated like a physical resource!
th: โปรดทราบว่าศรัทธาจะได้รับการปฏิบัติเช่นเดียวกับทรัพยากรทางกายภาพ!

source: This means that your inhabitants need a road connection to the producer (Pavilion) to pick up faith there.
th: ซึ่งหมายความว่าผู้อยู่อาศัยของคุณต้องการการเชื่อมต่อเส้นทางกับผู้ผลิต(ศาลา) เพื่อรับศรัทธาจากที่นั่น.
