Repository: btdn/unknown-horizons
Catalog: po/scenarios/*/tutorial.po
Languages: th

source: After some time, they will have consumed it and then again look for a producer to collect more faith.
th: หลังจากเวลาผ่านไปเมื่อพวกเขาเริ่มรู้สึกสูญเสียความศรัทธา พวกเขาก็จะเริ่มมองหาผู้ผลิตเพื่อรวบรวมศรัทธาขึ้นมาใหม่อีกครั้ง.

source: Important: It is NOT enough that the building is merely within a certain range of the Tents. The road connection is required as well.
th: สิ่งสำคัญ: สิ่งปลูกสร้างบางชนิดเพียงแค่สร้างให้อยู่บริเวณเต็นท์ยังคงไม่เพียงพอต่อความต้องการ การเชื่อมต่อเส้นทางถนนเข้าไปที่นั่นก็จำเป็นเช่นกัน.

source: Task: Build a Pavilion with a Trail to the Tents in order to fulfill your sailors' demand for faith.
th: งาน: สร้างศาลาพร้อมด้วยเชื่อมต่อเส้นทางกับเต็นท์ที่พัก เพื่อช่วยเติมเต็มความต้องการของลูกเรือในด้านของความเชื่อ.

source: Set the tax level to Low (left end) and wait for your sailors to upgrade.
th: ตั้งระดับของภาษีให้เป็นระดับต่ำ(ซ้ายสุด) แล้วรอให้กะลาสีของคุณอัพเกรด.

source: NEW TASK: NEXT TIER
th: งานใหม่: ก้าวสู่ระดับต่อไป

source: All demands are fulfilled now if your inhabitants can regularly visit the Main Square and the Pavilion and your food supply is adequate.
th: ความต้องการทั้งหมดได้รับการเติมเต็มแล้วในขณะนี้ ผู้อยู่อาศัยของคุณสามารถเยี่ยมชมจัตุรัสหลักและศาลาเป็นประจำ และแหล่งอาหารของคุณก็มีอยู่อย่างเพียงพอแล้ว.

source: If the sailors are happy enough, they want to advance to the next tier called Pioneers.
th: หากลูกเรือมีความสุขมากพอพวกเขาต้องการก้าวไปสู่ระดับถัดไปที่เรียกว่าผู้บุกเบิก.

source: To make them happy, there is nothing else for you to do but setting taxes to a lower level since you have fulfilled all the demands of your inhabitants.
th: เพื่อให้พวกเขาได้มีความสุขไม่มีอะไรให้คุณทำนอกจากตั้งค่าภาษีให้อยู่ในระดับที่ต่ำ เนื่องจากคุณได้ทำตามความต้องการทั้งหมดของผู้อยู่อาศัยไปแล้ว.

source: You should try to not always run on low taxes since this will probably lead to bankruptcy sooner or later. For a period of time and if you know what you are doing, it is fine though.
th: คุณควรพยายามหลีกเลี่ยงอัตราภาษีระดับต่ำเป็นเวลานาน เพราะอาจทำให้เกิดการล้มละลายในไม่ช้าก็เร็ว แค่เพียงชั่วระยะเวลาหนึ่งหรือถ้าคุณรู้ว่าคุณกำลังทำอะไรอยู่มันก็ใช้ได้แล้ว.

source: After some time, the first unit should walk to the Main Square and have a look for new construction material there to build a log house. This house will replace the old tent.
th: หลังจากเวลาผ่านไปผู้อยู่อาศัยชุดแรกจะเดินไปที่จัตุรัสหลักและมองหาวัสดุก่อสร้างใหม่เพื่อสร้างบ้านไม้ บ้านประเภทนี้จะเปลี่ยนสภาพเต็นท์เก่าๆให้น่าอยู่อาศัยมากขึ้น.

source: Such residential upgrades cost resources and can thus be restricted at the Main Square.
th: การอัพเกรดที่อยู่อาศัยดังกล่าวมีค่าใช้จ่ายและสามารถถูกจำกัดได้จากจัตุรัสหลัก.

source: There also are upgrades of buildings without costs, as you will see with the lumberjack. In this case, only the graphics change.
th: นอกจากนี้ยังมีการอัพเกรดสิ่งปลูกสร้างแบบไม่มีค่าใช้จ่าย เช่นเดียวกับที่คุณเห็นจากเต็นท์ของคนตัดไม้ ในกรณีนี้เกิดขึ้นเฉพาะการเปลี่ยนแปลงของภาพกราฟิก.

source: Upgraded housing accomodates more inhabitants, and pioneers pay more taxes than sailors, too.
th: ที่อยู่อาศัยที่ได้รับการอัพเกรดจะรองรับผู้อยู่อาศัยได้มากขึ้น และผู้บุกเบิกต้องจ่ายภาษีมากกว่าลูกเรือด้วยเช่นกัน.

source: As you may have figured out already, the downside is that pioneers demand additional goods which sailors do not need - so you will need to spend this extra money to make them happy as well.
th: ในตอนนี้คุณอาจจะคิดออกแล้ว ข้อเสียคือผู้บุกเบิกต้องการสินค้าบางอย่างเพิ่มเติมซึ่งเป็นสิ่งที่ลูกเรือไม่ต้องการ - ดังนั้นคุณจะต้องใช้เงินพิเศษที่ได้มานี้เพื่อทำให้พวกเขาได้มีความสุขด้วยเช่นกัน.

source: Task: Set the tax level to Low (left end) and wait for sailors to upgrade.
th: งาน: ตั้งค่าระดับภาษีเป็นระดับต่ำ(ซ้ายสุด) แล้วรอให้กะลาสีได้อัพเกรด.

source: Build a Farm and keep some empty space around it.
th: สร้างฟาร์มและรักษาพื้นที่รอบๆให้เป็นพื้นที่ว่างเอาไว้.

source: NEW TASK: BUILD A FARM
th: งานใหม่: สร้างฟาร์ม

source: Congratulations! Some of your inhabitants have reached tier II!
th: ขอแสดงความยินดี! ผู้อยู่อาศัยของคุณบางคนมาถึงระดับที่สองแล้ว!

source: Now you have access to new buildings, take a look at the Build menu again.
th: ตอนนี้คุณสามารถเข้าถึงสิ่งปลูกสร้างชนิดใหม่ ลองกลับไปดูที่เมนูสร้างอีกครั้ง.

source: A shiny new tab appeared there.
th: มีแท็บใหม่ที่เป็นประกายปรากฏขึ้นที่นั่น.

source: Pioneers will demand cloth, so you need to set up a production line for cloth starting with lambs wool (which is one of the goods produced at the Farm).
th: ผู้บุกเบิกมีความต้องการเสื้อผ้า ดังนั้นคุณต้องตั้งสายการผลิตผ้าที่เริ่มต้นด้วยขนแกะ(ซึ่งเป็นหนึ่งในสินค้าที่ผลิตได้จากฟาร์ม).

source: The Farm is a very special production building since it can produce not only one, but many (and different) goods if you choose.
th: ฟาร์มเป็นสิ่งปลูกสร้างที่พิเศษมากเพราะมันสามารถผลิตสินค้าได้ไม่ใช่แค่เพียงอย่างเดียว แต่ยังมีสินค้ามากมาย(และแตกต่างกัน) หากคุณเลือก.

source: The output of Farms depends on what kind of fields you build around it.
th: ผลผลิตของฟาร์มขึ้นอยู่กับพื้นที่ทางการเกษตรที่คุณได้สร้างขึ้น.

source: We will have a closer look at this later.
th: เราจะไปดูเรื่องนี้กันอย่างละเอียดในภายหลัง.

source: Farms, like all companies producing raw materials, do not necessarily need to be connected to storage or a Warehouse.
th: ฟาร์มก็เป็นเช่นเดียวกับทุกๆแหล่งผลิตวัตถุดิบ มันไม่จำเป็นต้องเชื่อมต่อกับโกดังหรือคลังสินค้า.

source: As long as units of the final production company can reach the Farm, and collectors from the Warehouse or Storage Tent can reach the final company everything's fine.
th: ตราบใดที่ยูนิตจากฝ่ายผลิตขั้นสุดท้ายสามารถไปถึงฟาร์มได้ และคนงานจากคลังหรือเต็นท์เก็บของสามารถไปถึงแหล่งผลิตสุดท้ายได้ ทุกอย่างก็สามารถดำเนินไปได้ด้วยดี.

source: If you, however, plan to do some processing on different parts of the island (which can make sense) or even on different islands, you will need a connection to collectors.
th: อย่างไรก็ตามหากคุณวางแผนที่จะทำการผลิตบางส่วนในพื้นที่ส่วนอื่นของเกาะ(ซึ่งอาจสมเหตุสมผล) หรือแม้กระทั่งบนเกาะอื่นๆคุณจะต้องเชื่อมต่อกับคนงานจากคลังสินค้า.

source: Try to build the Farm not too close to the coast or your existing buildings since it will need some space around it to work well.
th: ลองสร้างฟาร์มให้ห่างจากชายฝั่งหรือสิ่งปลูกสร้างอื่นๆที่คุณมีอยู่ เพราะมันจะต้องใช้พื้นที่รอบๆเพื่อให้สามารถทำงานได้ดี.

source: Task: Build a Farm.
th: งาน: สร้างฟาร์ม.

source: Build at least one pasture and add potato fields if you like.
th: สร้างทุ่งเลี้ยงสัตว์อย่างน้อยหนึ่งแห่ง และเพิ่มไร่มันเทศหากคุณต้องการ.

source: NEW TASK: BUILD FIELDS
th: งานใหม่: สร้างพื้นที่ทำการเกษตร

source: The Farm itself is not going to produce anything without some fields.
th: โดยตัวฟาร์มเองแล้วมันจะไม่ผลิตอะไรเลยหากไม่มีพื้นที่สำหรับทำการเกษตร.

source: You currently have the choice between pastures, potato and sugar fields.
th: ในตอนนี้คุณมีตัวเลือกระหว่างไร่มันฝรั่งกับไร่อ้อย.

source: Let's have a short overview: * Pasture: Sheep live here, producing lamb wool. * Potato Field: Grows potatoes which are currently treated as food. * Sugar Field: Grows sugar which is used to distill liquor and (later) produce confectionery.
th: มาดูภาพรวมคร่าวๆ: * ทุ่งเลี้ยงสัตว์: แกะถูกเลี้ยงที่นี่เพื่อผลิตขนแกะ. * ไร่มันฝรั่ง: ปลูกมันฝรั่งซึ่งปัจจุบันถือว่าเป็นอาหารชนิดหนึ่ง. * ไร่อ้อย: ปลูกอ้อยเพื่อใช้ในการกลั่นเหล้าและน้ำตาล เพื่อนำไปผลิตเป็นขนมในภายหลัง.

source: We now only need pastures, but in case your food supply chain is too small (maybe many residential buildings) you can also produce some potatoes.
th: ตอนนี้เราต้องการเพียงทุ่งเลี้ยงสัตว์ แต่หลังจากที่ห่วงโซ่อาหารของคุณเริ่มมีน้อยเกินไป(อาจเป็นหลังจากมีที่พักอาศัยจำนวนมาก) คุณสามารถเริ่มผลิตมันฝรั่งได้.

source: Note that for potatoes you will need a road connection to the Farm (not to the field!), as it will be the only company to work on the goods.
th: โปรดทราบว่าสำหรับมันฝรั่งคุณจะต้องเชื่อมต่อเส้นทางกับฟาร์ม(ไม่ใช่ไปที่ไร่!) เนื่องจากเป็นแหล่งผลิตเดียวที่ทำหน้าที่เกี่ยวกับการผลิตสินค้า.

source: Make sure that all fields you build are in the area covered by the Farm.
th: ตรวจสอบให้แน่ใจว่าไร่ที่คุณสร้างอยู่ในพื้นที่ที่ครอบคลุมโดยฟาร์ม.

source: You can have combined production - one pasture will not lead to 100 percent efficiency of the Farm - but you need to check how many fields one Farm can serve.
th: คุณสามารถรวมการผลิตได้ เช่น ทุ่งเลี้ยงสัตว์หนึ่งแห่งจะไม่นำไปสู่การผลิตของฟาร์ม 100 เปอร์เซ็นต์ แต่คุณต้องตรวจสอบว่าฟาร์มสามารถให้บริการได้กี่พื้นที่การเกษตร.

source: Different classes of fields require the farm units to spend more or less time there (to seed, harvest, herd, etc…) and because of that, the farm may be unable to serve all of the fields you built for it in time.
th: พื้นที่ทางการเกษตรประเภทต่างๆต้องการคนงานจากฟาร์มและต้องใช้เวลาเมื่ออยู่ที่นั่น(เพาะเมล็ด, เก็บเกี่ยว, เลี้ยงสัตว์ ฯลฯ) ด้วยเหตุนี้ฟาร์มจึงไม่สามารถให้บริการพื้นที่การเกษตรทั้งหมดที่คุณสร้างได้ทันเวลา.

source: For now, you do not need to care about these issues a lot since you haven't built any fields. Let's change that!
th: ในตอนนี้คุณไม่จำเป็นต้องสนใจปัญหาเหล่านี้มากนัก เนื่องจากคุณยังไม่ได้สร้างพื้นที่การเกษตรใดๆ มาเปลี่ยนกันเถอะ!

source: Task: Build at least one Pasture in the Farm's range and add Potato Fields if you like.
th: งาน: สร้างทุ่งเลี้ยงสัตว์อย่างน้อยหนึ่งแห่งในระยะของฟาร์มและเพิ่มไร่มันฝรั่งหากคุณต้องการ.

source: Build a storage tent (tier I tab) where it makes sense.
th: สร้างเต็นท์จัดเก็บ(แถบระดับ I) บนพื้นที่ที่เหมาะสม.

source: NEW TASK: BUILD STORAGE
th: งานใหม่: สร้างโกดังเก็บของ

source: Did you watch your lumberjack recently?
th: คุณได้ลองแวะไปดูคนตัดไม้เมื่อเร็วๆนี้ไหม?

source: Since your Warehouse does not have unlimited space to store goods, collectors will stop fetching goods from companies when stock is full.
th: เนื่องจากคลังสินค้าของคุณมีพื้นที่จำกัดในการจัดเก็บสินค้า คนงานจะหยุดรับสินค้าจากแหล่งผลิตเมื่อสต็อกสินค้าเต็ม.

source: So if no sailors recently wanted to upgrade their tents, you probably have a lot of boards and in that case, the lumberjack may idle.
th: ดังนั้นหากไม่มีกะลาสีที่ต้องการอัพเกรดเต็นท์ของพวกเขาเมื่อเร็วๆนี้ คุณอาจมีไม้กระดานเหลืออยู่มากและในกรณีนั้นคนตัดไม้จะหยุดทำงาน.

source: We can improve this situation in two different ways, and we will have a look at both of them below.
th: เราสามารถแก้ไขสถานการณ์นี้ได้สองวิธีแตกต่างกัน และเราจะได้ดูทั้งสองวิธีด้านล่างนี้.

source: All companies offer to do no work at all. This may sound strange, but click on the gear wheel you see in the Lumberjack Hut's overview.
th: แหล่งผลิตทั้งหมดเสนอว่าจะไม่ทำงานเลย. นี่อาจฟังดูแปลก แต่ลองคลิกที่เฟืองที่คุณเห็นในส่วนภาพรวมของแหล่งตัดไม้.

source: If this 'break' mode is enabled (we call it 'Decommissioning'), the running costs you pay for the building will decrease. They won't be zero, but still lower than if you keep the company producing.
th: หากเปิดใช้งานโหมด 'หยุด' (เราเรียกมันว่า 'การเพิกถอน') ค่าใช้จ่ายที่ต้องใช้สำหรับบำรุงสิ่งปลูกสร้างจะลดลง พวกมันจะไม่เป็นศูนย์แต่ก็ถือว่าต่ำกว่าถ้าคุณยังต้องการให้แหล่งผลิตทำงาน.

source: This means that you can save money when you temporarily do not need a company and do not want to tear it down, either.
th: ซึ่งหมายความว่าคุณสามารถประหยัดเงินได้เมื่อคุณไม่จำเป็นต้องใช้แหล่งผลิตนั้นชั่วคราว และไม่ต้องการรื้อถอนแหล่งผลิตด้วยเช่นกัน.

source: Another solution is to build the last tier-I building which has not been mentioned so far: the Storage Tent.
th: อีกวิธีหนึ่งคือการสร้างสิ่งปลูกสร้างระดับ I สุดท้าย ซึ่งยังไม่ได้ถูกกล่าวถึง: เต็นท์เก็บของ.

source: This building has two purposes. It: * Offers more storage for your goods, and * sends its own collectors to fetch goods, just like the Warehouse does.
th: สิ่งปลูกสร้างนี้มีวัตถุประสงค์สองประการ, มันจะ: * มอบพื้นที่เก็บของเพิ่มให้กับคลังสินค้า และ * ส่งคนงานออกไปเพื่อเก็บสินค้าเหมือนที่คลังสินค้าทำ.

source: Note that companies can also be connected to a storage in order to get their products collected, and if the Warehouse is overwhelmed with collector tasks, you can place a Storage Tent to help out there.
th: โปรดทราบว่าแหล่งผลิตต่างๆสามารถเชื่อมต่อกับที่เก็บของเพื่อเก็บทรัพยากรที่รวบรวมได้และถ้าหากคลังสินค้ามีงานสะสมอยู่มากมาย คุณสามารถวางเต็นท์เก็บของไว้เพื่อช่วยแบ่งงานจากคลัง.

source: Task: Build a Storage Tent, preferably where you need collectors.
th: งาน: สร้างเต็นท์เก็บของจำเป็นอย่างยิ่งหากคุณต้องการพื้นที่เก็บของเพิ่ม.

source: Build a Weaver's Hut that can somehow reach the wool of your Farm.
th: สร้างกระท่อมของคนทอผ้าที่สามารถเข้าไปรับขนแกะได้จากฟาร์มของคุณ.

source: NEW TASK: BUILD A WEAVER
th: งานใหม่: สร้างกระท่อมของคนทอผ้า

source: Now the wool production is set up, you still need a weaver to produce cloth out of this wool.
th: ตอนนี้มีสายการผลิตผ้าขนสัตว์ของคุณยังต้องการใช้งานช่างทอผ้าเพื่อผลิตผ้าขนสัตว์.

source: The Weaver's Hut is the place where the weaver lives. There are two spots where you can build it - either close to the Farm or close to a Storage Tent (or the Warehouse).
th: กระท่อมของคนทอผ้าก็คือสถานที่ที่ช่างทอผ้าอาศัยอยู่ มีสองจุดที่คุณสามารถสร้างได้ - ใกล้กับฟาร์มหรือใกล้กับเต็นท์เก็บของ(หรือคลังสินค้า).

source: In both cases you should ensure the connection to a Trail as well.
th: ในทั้งสองกรณีคุณควรเชื่อมต่อเข้ากับเส้นทางด้วยเช่นกัน.

source: You can place the Weaver's Hut close to the Farm and tear down any Trail to the Farm to see that it will still fetch the wool and produce.
th: คุณสามารถวางกระท่อมของคนทอผ้าไว้ใกล้ๆกับฟาร์มแล้วลากเส้นทางเชื่อมต่อไปที่ฟาร์มเพื่อเช็คดูว่ามันยังคงไปรับขนแกะและทำการผลิต.

source: Task: Build a Weaver's Hut positioned so it can get wool.
th: งาน: สร้างกระท่อมของคนทอผ้าให้อยู่ในตำแหน่งที่สามารถไปรับขนสัตว์ได้.

source: House a total of 50 or more inhabitants in your city to complete the tutorial. You need a positive balance.
th: เพื่อให้บทช่วยสอนนี้เสร็จสมบูรณ์คุณจะต้องมีผู้อยู่อาศัยภายในเมืองทั้งหมด 50 คนขึ้นไป และคุณต้องมีความสมดุลในเชิงบวก.

source: NEW TASK: COMPLETE TUTORIAL
th: งานใหม่: ทำให้บทช่วยสอนเสร็จสมบูรณ์

source: Try to house a total of 50 or more inhabitants in your city by providing more residential buildings.
th: พยายามทำให้มีผู้อยู่อาศัยภายในเมืองของคุณ 50 คนหรือมากกว่านี้ โดยการจัดหาที่พักอาศัยเพิ่มมากขึ้น.

source: Once you are able to keep an economy running which can satisfy this amount of consumers, you are ready to discover new Unknown Horizons!
th: หลังจากที่คุณสามารถทำให้เศรษฐกิจดำเนินต่อไปเพื่อตอบสนองผู้บริโภคในจำนวนนี้ได้ คุณก็พร้อมที่จะค้นพบสิ่งใหม่ๆใน Unknown Horizons!

source: You also need enough money to keep this economy running, so a positive balance (check in the Warehouse tab 'Account') is required.
th: นอกจากนี้คุณยังต้องการเงินมากพอที่จะทำให้เศรษฐกิจทำงานต่อไปได้ ดังนั้นจึงจำเป็นต้องมีสมดุล(ดูที่แถบบัญชีในคลังสินค้า)ในเชิงบวก.

source: Task: Reach a total number of 50 inhabitants and a positive balance to complete this tutorial.
th: งาน: มีผู้อยู่อาศัยทั้งหมด 50 คนและสร้างสมดุลที่ดีเพื่อให้บทช่วยสอนนี้เสร็จสมบูรณ์.

source: Congratulations! You have reached the end of this tutorial and are ready to meet new challenges!
th: ขอแสดงความยินดี! คุณมาถึงจุดสิ้นสุดของบทช่วยสอนนี้แล้ว และพร้อมที่จะพบกับความท้าทายใหม่!

source: NO TASKS LEFT
th: ไม่มีงานที่ต้องทำแล้ว

source: You have successfully completed all tasks that were handed to you. The world is now at your command, waiting for your free aspirations and brave explorations!
th: คุณทำภารกิจทั้งหมดที่มอบให้สำเร็จแล้ว ตอนนี้โลกอยู่ภายใต้คำสั่งของคุณ, รอให้เกิดแรงบันดาลใจแล้วเริ่มทำการสำรวจครั้งใหม่อย่างกล้าหาญ!

source: If you have any suggestions on what we could or should improve, add or leave out:
th: หากคุณมีข้อเสนอแนะใดๆเกี่ยวกับสิ่งที่เราสามารถทำได้หรือควรปรับปรุง, เพิ่มเข้ามาหรือนำออกไป:

source: Our forums are open to you as well!
th: ฟอรั่มของเราก็เปิดต้อนรับคุณด้วยเช่นกัน!

source: The best results until now were achieved by joining our IRC channel, so you could try that out first (-;
th: วิธีที่ดีที่สุดในตอนนี้ทำได้โดยการเข้าร่วมช่องทาง IRC ของเรา คุณสามารถลองใช้ช่องทางนี้ได้ทันที (-;

source: Thanks!
th: ขอขอบคุณ!

source: Thanks for playing the tutorial! Your UH-Team
th: ขอบคุณที่ได้เล่นบทช่วยสอน! ทีมผู้พัฒนา Unknown Horizons.
