Repository: btdn/unknown-horizons
Catalog: po/uh-server/*.po
Languages: hr

source: Old or unsupported multiplayer protocol. Please check your game version
hr: Star ili nepodržan protokol za više igrača. Provjeri verziju igre

source: You've exceeded the global packet size.
hr: Premašio/la si globalnu veličinu paketa.

source: This should never happen. Please contact us or file a bug report.
hr: Ovo se nikada ne bi trebalo dogoditi. Kontaktiraj nas ili pošalji izvještaj o grešci.

source: You've exceeded the per packet size.
hr: Premašio/la si veličinu po paketima.

source: Unknown or malformed packet. Please check your game version
hr: Nepoznat ili neispravan paket. Provjeri verziju igre

source: Invalid/Unknown session
hr: Neispravna/Nepoznata sesija

source: You can't join a game while in another game
hr: Ne možeš se pridružiti jednoj igri dok se nalaziš u jednoj drugoj igri

source: Unknown game or game is running a different version
hr: Nepoznata igra ili je igra pokrenuta s drugačijom verzijom

source: Game has already started. No more joining
hr: Igra je započela. Nitko se više ne može pridružiti

source: Game is full
hr: Igra je puna

source: Wrong password
hr: Kriva lozinka

source: There's already a player with your name inside this game.
hr: Već postoji igrač s tvojim imenom u ovoj igri.

source: Please change your name.
hr: Promijeni svoje ime.

source: There's already a player with your color inside this game.
hr: Već postoji igrač s tvojom bojom u ovoj igri.

source: Please change your color.
hr: Promijeni svoju boju.

source: There's already a player with your unique player ID inside this game. This should never occur.
hr: U igri se već nalazi igrač s tvojim jedinstvenim ID-om igrača. To se nikada ne bi smjelo dogoditi.

source: You are not inside a game
hr: Ne nalaziš se u igri

source: The game has been terminated. The creator has left the game.
hr: Igra je prekinuta. Stvaratelj je napustio igru.

source: One player has terminated their game. For technical reasons, this currently means the game cannot continue. We are very sorry about that.
hr: Jedan je igrač prekinuo igru. Iz tehničkih razloga, to trenutačno znači, da se igra ne može nastaviti. Žao nam je.

source: Unable to change your name.
hr: Nije moguće promijeniti tvoje ime.

source: Unable to change your color.
hr: Nije moguće promijeniti tvoju boju.

source: You can't fetch a game while in another game
hr: Ne možeš preuzeti igru dok se nalaziš u drugoj igri
