Repository: btdn/unknown-horizons
Catalog: po/voices/*.po
Languages: th

source: Strive so that this settlement shall evolve stately.
th: จงพยายามอย่างเต็มที่เพื่อให้การตั้งถิ่นฐานนี้มีวิวัฒนาการยิ่งใหญ่.

source: Your inhabitants will certainly feel comfortable on this island.
th: พลเมืองของคุณจะต้องรู้สึกสะดวกสบายบนเกาะแห่งนี้อย่างแน่นอน.

source: Call this patch of ground yours from now on.
th: เรียกที่ดินบริเวณนี้ว่าเป็นของคุณได้แล้วตั้งแต่ตอนนี้.

source: This region now belongs to our colors.
th: ตอนนี้ภูมิภาคนี้เป็นของเราแล้ว.

source: This piece of ground is now ours.
th: บางส่วนของพื้นดินในตอนนี้เป็นของเรา.

source: Another player has settled on an island.
th: ผู้เล่นคนอื่นได้ตั้งถิ่นฐานบนเกาะ.

source: A player develops a new settlement.
th: ผู้เล่นได้พัฒนานิคมใหม่.

source: One of your fellow players founded a settlement.
th: หนึ่งในผู้เล่นที่คุณติดตามได้ก่อตั้งนิคมใหม่.

source: A rival of ours seems to have founded a settlement.
th: คู่แข่งของเราดูเหมือนว่าพวกเขากำลังก่อตั้งการตั้งถิ่นฐานใหม่.

source: We've been informed that one of our rivals snared new land.
th: เราได้รับรายงานมาว่าหนึ่งในคู่แข่งของเราได้ตกหลุมพรางบนดินแดนใหม่.

source: One of our opponents is said to have expanded.
th: หนึ่งในคู่แข่งของเราบอกว่าจะมีการขยายตัว.

source: Our ally settles on another island.
th: พันธมิตรของเราตั้งถิ่นฐานอยู่บนเกาะอื่น.

source: One of our allies cultivates an islnd.
th: หนึ่งในพันธมิตรของเราได้ทำการถากถางบนเกาะ.

source: Our ally passes news about successfully founding a settlement.
th: พันธมิตรของเราได้ส่งข่าวเกี่ยวกับการก่อตั้งการตั้งถิ่นฐานสำเร็จ.

source: This island no longer is all ours.
th: เกาะแห่งนี้ไม่ได้เป็นของเราทั้งหมด.

source: Scouts found out that guests settled on one of our islands.
th: หน่วยลาดตระเวนพบว่ามีแขกขึ้นมาตั้งถิ่นฐานอยู่บนเกาะแห่งหนึ่งของเรา.

source: We got new neighbors on this island!
th: เรามีเพื่อนบ้านใหม่บนเกาะนี้!

source: Scouts report that uninvited guests beleaguer our island!
th: รายงานหน่วยลาดตระเวนมาว่า มีแขกที่ไม่ได้รับเชิญเข้ามาเยี่ยมชมเกาะของเรา!

source: Should we really accept our rival as new neighbor?
th: เราควรยอมรับคู่แข่งของเราในฐานะเพื่อนบ้านใหม่ดีหรือไม่?

source: One of our enemies settles on our ground!
th: หนึ่งในศัตรูของเราเข้ามาตั้งถิ่นฐานอยู่บนพื้นดินของเรา!

source: One of our allies seems in desperate need of your ground.
th: ดูเหมือนว่าพันธมิตรที่กำลังหมดหวังคนหนึ่ง กำลังจะตั้งถิ่นฐานบนดินแดนของคุณ.

source: We share this ground with our ally for now.
th: เราได้แบ่งปันพื้นดินนี้กับพันธมิตรของเราในตอนนี้.

source: Our ally settles on one of our islands.
th: พันธมิตรของเราได้มาตั้งถิ่นฐานอยู่บนเกาะแห่งหนึ่งของเรา.

source: You need more resources to build this.
th: คุณต้องการทรัพยากรเพิ่มเติมเพื่อสร้างสิ่งนี้.

source: This construction project needs more resources.
th: โครงการก่อสร้างนี้ต้องการทรัพยากรมากกว่านี้.

source: Construction is impossible without sufficient material.
th: การก่อสร้างเป็นไปไม่ได้หากไม่มีวัสดุสำรองเอาไว้อย่างเพียงพอ.

source: The resources in your inventory are not sufficient to build this.
th: ทรัพยากรในคลังของคุณไม่เพียงพอที่จะสร้างสิ่งนี้.
